[
  {
    "id": "20241021-cls-062-V1-TRX",
    "fileName": "20241021-cls-062-V1-TRX",
    "date": "2024-10-21",
    "series": "CLS",
    "episodeNumber": "062",
    "episodeTitle": "Heidrick & Struggles Leadership Podcast",
    "hosts": [
      "Jarrad Roeder",
      "Jennifer Streitwieser"
    ],
    "guests": [
      "Clint Grimes"
    ],
    "guestWorkExperience": [
      {
        "name": "Clint Grimes",
        "title": "SVP, Chief Procurement Officer",
        "company": "Capital One"
      },
      {
        "name": "Clint Grimes",
        "title": "Vice President of Global Sourcing",
        "company": "Warner Media"
      }
    ],
    "transcript": "\n\n**VO**: Welcome to the Heidrick & Struggles Leadership podcast. Heidrick is the premier global provider of senior level executive search and leadership consulting services. Diversity and inclusion, leading through tumultuous times and building thriving teams and organizations are among the core issues we talk with leaders about every day, including in our podcasts.\n\nThank you for joining the conversation.\n\n**Jarrad Roeder** (Host): Hi, welcome to the Heidrick & Struggles Leadership Podcast. I'm Jared Roeder, principal with Heidrick and Struggles Philadelphia office, and a member of Heidrick Consulting. I'm also joined today by my colleague, Jennifer Streitwieser.\n\n**Jennifer Streitwieser** (Host): Hello all and welcome. I'm Jennifer Streitwieser. I'm a partner in Heidrick & Struggles Philadelphia office, and I'm also a member of Heidrick Consulting.\n\n**Jarrad Roeder** (Host): Today we're delighted to be joined by Clint Grimes, SVP, and Chief [00:01:00] Procurement Officer at Capital One. Clint joined Capital One as the chief procurement Officer and head of Enterprise Supplier Management or ESM in May of 2021. Clint leads the team responsible for the supplier value chain, which includes sourcing and supplier selection, contract negotiations, purchase order, and invoice management, and delivering third party risk governance for goods and services.\n\nPartnering closely and proactively with business owners across the firm. Clint's team seeks to maximize supplier relationships while ensuring all vendors are fully compliant with the company's third party management policies and procedures. He's also responsible for Capital One's award-winning supplier diversity program, which seeks to develop and grow diverse owned businesses.\n\nPreviously, he served as vice president of global sourcing at Warner Media. His board service includes membership on the boards of the Women's Business Enterprise National Council, and the advisory board of the Howard University School of Business Center for Excellence in Supply Chain Management. Clint, thank you so much for joining us today.[00:02:00]\n\n**Clint Grimes** (Guest): Hey, thanks for having me.\n\n**Jennifer Streitwieser** (Host): So, Clint, to kick us off, how is the role of procurement evolving at Capital One?\n\n**Clint Grimes** (Guest): It's an interesting question 'cause it's, it's like the role of procurement is evolving. Just period. I've been in this space for going on 30 years, and in the early days it was. Really focused on sort of operational the needs for like a manufacturing process and really making sure sort of throughput happens and that vendors got paid.\n\nIt's evolved over time as kind of American business or business in general has evolved to be much more. Tech focused, much more risk management focused. And so as you can imagine, the needs of the business driving the needs of procurement has really been the constant, I think is interesting. I was talking to somebody fairly recently about, I remember when like the first sort of tech tools were rolled out for procurement that sort of led to.[00:03:00]\n\nThis tool or this effort around online reverse auctions. And it's interesting to see how we've moved from that being sort of cutting edge technology to where we are today.\n\n**Jennifer Streitwieser** (Host): So what implications does this have for the skills and capabilities needed by procurement leaders and professionals?\n\n**Clint Grimes** (Guest): Yeah, as you can imagine, so hearkening back to those days, procurement was generally made up of it's interesting, generalists or specialists.\n\nSo they were generalists in things like. Project management or process management, or they were specialists in a particular category. I cut my teeth in automotive industry. And so someone with a deep understanding of materials processing, for instance, would be a great candidate for a procurement role in that kind of environment.\n\nAnd as I said earlier, what's been happening is this. Evolution of the needs of the business and therefore the capabilities of those resources changing. It has gotten to the point where there is [00:04:00] a huge IT component. Everything is technology these days, and so the ability to speak the language, understand the market really drive.\n\nUnderstanding of the innovation in that space has gotten to be really, really important. But another thing that's happened as well has been the needs for procurement to move from being a tactical set of activities to being truly as strategic partner to the business. You'll hear a lot of commentary these days around the effects of the pandemic and how the pandemic laid bare the.\n\nTreatment of procurement or supply chain functions as being. Operational in nature and the supply chain shortages that the pandemic kind of exacerbated made corporate leaders more aware of the strategic nature of their supply chain and their need to have [00:05:00] resources that are thinking I. Into the future or driving different behaviors to ensure that business disruptions were minimized or eliminated, ideally.\n\nSo you need more strategic thinkers in the space. So that's one piece. I think another piece is you are also looking for more thoughtful strategic partners. To the lines of business. So those skills around influence, those skills around collaboration, those skills around, you know, bringing people along essentially in ways that perhaps weren't the case before.\n\nAnd also in that you have the need to learn how to eloquently say no. Procurement was usually seen as an enabler and it still is to be fair. But procurement is playing a much more interesting role in the risk management space and supporting the [00:06:00] business in a way that may have the business not so happy.\n\nAt least in the moment of the advice that they're getting from the procurement function. And so having individuals with skills that are able to navigate not being liked in some cases, and able to steer. A decision in a way that is appropriately risk sloped. That's a really big change. And so if you think about sort of the skillset, it's less about skills around, again, that process or change management function and more about, or inclusive of that would also be skills around influence and skills around diplomacy, I think I'd call it.\n\nThose are becoming more important.\n\n**Jarrad Roeder** (Host): So, Clint, as you think about some of these broader strategic shifts for the function, what do you see as the role of culture in making those shifts happen. [00:07:00]\n\n**Clint Grimes** (Guest): Yeah. So as you, if you think about that shift as you're saying, you think about that shift to this influencer having a culture where, for example, individuals feel comfortable in the fact that they're.\n\nFine, there's air cover or that they're being supported. When they do say no, when they do become roadblocks to progress. This notion of, I guess it's psychological safety, so having a culture where people are empowered and feel supported when they are contrarian, that's fundamentally important. If you're gonna have an effort or an activity around managing risk.\n\nAnd you are rowing against the current. You want to feel more comfortable being able to do that. And the only way you can do that is if you have an organization that's constructed in such a way that that comfort kind of goes without saying. And so there's one quote that I've shamelessly stolen from Peter Drucker, and everybody's heard it is this notion of culture eating [00:08:00] strategy for breakfast.\n\nYou can have. All the best laid plans and all the most defined and detailed ideas. But if you don't have the humans in the loop that are capable and comfortable making those decisions and feeling supported in the fact that they're doing that. I think the processes themselves and the expected outcomes become a challenge without the right culture and within ESM we've focused very much this past year on making sure that we got the culture component right for that reason.\n\nAnd we also shifted a little bit in the way that we measure. Performance. Historically, the metrics of success in this space have been really focused around savings and savings target, like achieving savings targets. That's not sufficient if you're creating savings that don't have this longevity or doesn't have this organizational sort of tailwind moving along with it.\n\nAnd so we've [00:09:00] enhanced the definitional metrics that we use to define success within ESM and that. Also is kind of a product of the changes in culture, but it's also an empowering component of the changes in culture because people are less concerned or hopefully they're less concerned about always being seen as cooperative and on the same page as clients, and they're able to perhaps be contrarian and not have that affect how they're seen as a performer in the organization.\n\n**Jarrad Roeder** (Host): Yeah, that makes good sense. And as you mentioned earlier, you've recently spent some time working on the culture at ESM and we know you've actually made some really great strides in that work. So curious, you know, what have been some of the most crucial mindset shifts that you've had to make across the team?\n\n**Clint Grimes** (Guest): Yeah, this, we're really proud of the positive change that we've seen this year and. One of those shifts is isn't really a shift, it's more of [00:10:00] an emphasis. In the early days when I joined the organization, we defined this sort of north star for ourselves, and that is having us be trusted advisors to our stakeholders.\n\nAnd we doubled down on that, or we emphasized that aspect to the point that it's okay to, like I said earlier, to be challengers. To your stakeholders, that is okay to say no, we'll have you say it. Sort of the eloquent way of saying no, it's like, no, but, or yes if, and we invested in the leadership across ESM to change their mindset and have that percolate throughout the organization around this.\n\nIf we're gonna be trusted advisors, we can't always say yes and everybody's not gonna like us, and that's okay. And really creating that understanding at all levels across the organization.\n\n**Jennifer Streitwieser** (Host): So Clint, what results have you started to [00:11:00] see from your focus on culture? Are there any key success factors that you would point to?\n\n**Clint Grimes** (Guest): I think results. It's an interesting one. I'll start with, I mean, there's plenty of them, so I'll start with one around, there's a level of. Likeness and happiness and just comradery across ESM that perhaps was muted. I'm not saying it wasn't there, but perhaps was muted before. So when you go in the office, there's a lot more joshing and a lot more just fun and joy I think that I see.\n\nSo that's one. Two is as we roll out goals and strategic priorities, we roll them out. In early 2024, we've just come off of an offsite where we are laying out the foundation for 2025. We're being a bit audacious, you know, we're not just looking to be incremental to the goals that we had for this year going into next year.[00:12:00]\n\nAnd there is this embracing of that, embracing of the challenge. This sort of bring it on. At the same time, there's a little bit of trepidation. We've got some interesting things on the horizon for Capital One in the next 12 months, but there's more excitement as opposed to fear and loathing or concern or any of that kind of a feel.\n\nAnd what it's created is, again, you have this joy, this camaraderie, this collaboration, this connection, and this feeling that we can take on. You know, whatever the system or, or the world has in store for us, that's what I've seen. I've seen a level of excitement that wasn't to this degree. It probably was there, but I've seen a higher level of excitement across the organization than I've seen before.\n\n**Jennifer Streitwieser** (Host): That's super. So what do you see as your role as a leader to build and maintain a healthy, high performance organizational culture? Are there any new skills or capabilities that [00:13:00] you are developing?\n\n**Clint Grimes** (Guest): I have to say that there's a bunch, and I'll start with I am very much an action oriented person and ready to sort of like run full steam ahead.\n\nI've become a much better listener and I've become much better at taking a beat. Before energizing something, and let me go back to this year when we had some of the challenges earlier in the year or late last year, there was this desire on my part to fix it, right? This is go out and let's fix the problem.\n\nLet's throw efforts or activities at the challenge. And it was very instructive. Very instructive to wait. Take a beat. Try to understand the root cause of the challenges that we were saying to determine a pathway that was measurable so we could understand how we were doing. Just being thoughtful. Not that I'm not thoughtful, but to be more [00:14:00] thoughtful in the way that we went about that and also.\n\nListening a lot. We've created these, I find them to be really, really energizing these listening circles and what they are are these small group sessions across the organization that give me the opportunity to hear firsthand from the practitioners, the folks that are doing the work on how. The changes that we are making are impacting or not impacting, that are affecting in a positive way or maybe not affecting in such a positive way.\n\nAnd having that sort of direct connection has been, again, instructive in helping me to map out what we're gonna emphasize and what we're gonna de-emphasize. We also made some changes to the organization and that was. A direct result of some of the feedback that we internally got from our leaders and what they received from their teams to make decision making much more straightforward.\n\nIt was a [00:15:00] better understanding of who was in charge of what. And then finally, I think for me, it's modeling the behavior. I am a very big fan of. Being sure that if I'm in the boat rowing just like everyone else and making sure that I'm seen and it's understood that that's the role I play. I am really thoughtful about making sure that there's an appreciation and that appreciation is expressed for the great work that our folks do.\n\nSo it's kind of a combination of those things, but I think every leader needs to find, of course, like their sort of natural state in doing that. And for me it is just. Doing my dead level best to be as connected to and as available to the organization as possible.\n\n**Jarrad Roeder** (Host): Alright. Well, I know our time together is coming to a close, but one final question for you, if we were able to zoom out a bit, what lessons learned might you share from your work on the culture at ESM?\n\nAny advice that you'd offer to others out [00:16:00] there who might be working on similar transformations?\n\n**Clint Grimes** (Guest): Yeah, I'll start with the idea that I said before is look before you leap. Begin with the end in mind. You know, make sure you understand what you're after, and then plan accordingly. So I think that's first. I think second is bring everybody along.\n\nBring everybody along. To do that, you have to meet everybody where they are. It's not a one size fits all. It's not a plug and chug. You're all set to go. So work to bring everybody along with you on the journey. Create mechanisms to measure. Make sure that if there is a goal out there, whatever it looks like, that there are points along the way and tools that you can deploy to measure your progress toward that goal, and at the right frequency to make sure that you can make course corrections as necessary.\n\nAnd in the course correction piece, I [00:17:00] would say I. Be adaptable. We made some changes to our trajectory and to our focus. Not the ultimate focus, but maybe the tactics around the focus as conditions on the ground warranted, and so making sure that you have the flexibility in your desired approach, the plan that you've created, that you're able to pivot or change as need be.\n\n**Jennifer Streitwieser** (Host): Well, Clint, thank you very much again for joining us today. We really appreciate your time.\n\n**Clint Grimes** (Guest): Yeah. Thank you very much. Thanks for having me.\n\n**Jarrad Roeder** (Host): Thanks, Clint.\n\n**VO**: Thanks for listening to the Heidrick & Struggles Leadership Podcast. To make sure you don't miss more future shaping ideas and conversations, please subscribe to our channel on the podcast app, and if you are listening via LinkedIn, Twitter, or YouTube, why not share this with your connections? Until next [00:18:00] time.\n\n",
    "audioLink": "",
    "wordCount": 2790,
    "extractedAt": "2025-10-28T05:15:29.727622",
    "keyTopics": [
      "Leadership",
      "Technology",
      "Healthcare",
      "Business Strategy",
      "Procurement",
      "Career Development"
    ],
    "notableQuotes": [],
    "summary": "In this episode of Heidrick & Struggles Leadership Podcast, host(s) Jarrad Roeder, Jennifer Streitwieser interview Clint Grimes key topics including Leadership, Technology, Healthcare. The conversation covers insights from experience at Warner Media, Capital One."
  },
  {
    "id": "20250128-Pulse-025-V3-TRX",
    "fileName": "20250128-Pulse-025-V3-TRX",
    "date": "2025-01-28",
    "series": "PULSE",
    "episodeNumber": "025",
    "episodeTitle": "PWC Pulse",
    "hosts": [
      "Yolanda Seals-Coffield",
      "Kathryn Kaminsky"
    ],
    "guests": [],
    "guestWorkExperience": [
      {
        "name": "Kathryn Kaminsky",
        "title": "US Chief Commercial Officer",
        "company": "PWC"
      }
    ],
    "transcript": "\n\n**VO**: Welcome to PWC Pulse, A podcast to provide insights to help you solve today's business challenges.\n\n**Yolanda Seals-Coffield** (Host): Hi, I'm Yolanda Seals Coffield, US Chief People and Inclusion Officer at PWC, and I'm excited to be with you on this episode of the PWC Pulse Podcast. In today's fast-paced business environment, companies are facing a combination of tech disruption shifting work.\n\nForce dynamics and evolving customer expectations From keeping up with market speed execution to building resilient talent pipelines and fostering organizational agility, leaders are navigating a complex path toward growth. One of the critical questions executives are asking is, how can we adapt to these shifts while advancing the potential of our people and processes to explore these topics?\n\nWe're bringing you a little bit of [00:01:00] a different format today. Joining me is our very own Kathryn Kaminsky, US Chief Commercial Officer here at PWC. Together we'll discuss this intersection of meeting the market demands with the right teams, what we're seeing, and how companies can stay ahead.  Kathryn, welcome to the podcast.\n\n**Kathryn Kaminsky** (Host): Thanks for having me, Yolanda. I'm really excited for this conversation.\n\n**Yolanda Seals-Coffield** (Host): I think it's gonna be a really good one. Why don't we start with some quick hits. I know you pretty well, but maybe our listeners will wanna know what is your favorite place in the world to visit?\n\n**Kathryn Kaminsky** (Host): You know, I don't know any place that I'm going.\n\nUh, this sounds ridiculous, but any place that I go with the whole family and go on an adventure, do you know what I mean? Yeah. Like, it's not the place, it's the company. That makes perfect sense. So my turn, what are you looking most forward to in the new year?\n\n**Yolanda Seals-Coffield** (Host): So 2025 is a good year for us. Sydnee graduates college.\n\nSo really looking forward to that. And then Eric and I will be married 25 years this year.\n\n**Kathryn Kaminsky** (Host): It is a big year. It's lots, a big year, lots of good things to celebrate.\n\n**Yolanda Seals-Coffield** (Host): All good things. Yeah. Okay, so let's get into [00:02:00] some of these questions. So you and I are gonna spend a little bit of time talking about this rapidly changing business environment.\n\nYou spend a lot of time with our clients. You spend a lot of time thinking about the commercialization of our business. And you and I talk a lot about talent shortages and so as we look at today's rapidly changing environment, one of the talent shortages that we spend a lot of time thinking about is in the accounting space.\n\nAnd I know that this is particularly personal and interesting to you. So give me some of your thoughts on what you would do to build resilient talent pipelines. The pipelines in the accounting profession in particular.\n\n**Kathryn Kaminsky** (Host): Yeah, I mean, it, it really is very personal to me, not just because I work at an accounting firm, like the Heritage being accounting, but my own personal story, right?\n\nThat I didn't start in accounting. I have a history degree. The firm has been extraordinarily good to me through my career. I am a CA and a CPA, and I have, as you know, college aged kids who do not wanna hear anymore do accounting. And I also do fundamentally believe that an [00:03:00] accounting background is one of the best backgrounds you can have.\n\nLike, you don't have to do it. To work for us forever, but like fundamentally, it is the love language of the business world, I like to say. So we do have to think about things differently with talent, not just us, as you say, around the accounting shortage and the things that we're doing around the accounting shortages, as you know, is around telling the story of what it means to be an accountant that it's.\n\nBeyond just dollars and cents that some people think working on spreadsheets. We have this incredible place that you can grow up and learn leadership skills, how to coach the opportunity that you've given our people through the training that you do on different things. Whether it's AI that's coming today with the program you're working on, or even throughout the career when it was your tomorrow as it relates to soft skills like\n\nAll of those things is really important to tell the story that what we can do and all the other things we do around mental health. Mm-hmm . And so when I think about it in the business sense to all of our clients is around selling the story of what it means [00:04:00] to both the person personally and in their own adventure.\n\nIt's choosing their adventure and how they grow, and also what that means for the long term to them. Because we have a responsibility, not just us, but business leaders as a whole to train our talent when they come outta school. They have a lot of great skills, but we have to think about the future. Where does it go?\n\nI think this is something you are really focused with us on, is what the future holds. Getting them ready for future skills, right? Not just the skills they have to today. It is something I'm passionate about because it's a give and take. They've gotta come and work with us and people come into the business world, but we have to train them and continuously train.\n\n**Yolanda Seals-Coffield** (Host): I love that. And I love that you say it's the love language. 'cause we talk so much about accounting skills, just being so foundational to the business world and you will never regret developing the skills that you'll develop as an accountant and you will take those skills anywhere throughout your career.\n\n**Kathryn Kaminsky** (Host): Totally. And I say this like I spend a lot of time at a lot of clients and I would say an accounting background is one of the only places that you, with each [00:05:00] year that you go through, we talk about the skills that you teach, but on the ground learning. Mm-hmm . By like one year . You're doing the next year, you're coaching, the next year you're supervising.\n\nLike all of that skillset that we can get at our firm is pretty amazing. Yeah, I think that's right. So we talked about talent shortage. You brought it up and this is your area, it's your love language. So as businesses are thinking about it, how should they be thinking about recruiting and training?\n\n**Yolanda Seals-Coffield** (Host): One of the interesting things is we are thinking about how you attack this on multiple fronts and so many other organizations are as well.\n\nSo if you think, how do we attract people to careers, . Early, get ourselves in front of college students as they're starting to navigate their way across campus and thinking about what they wanna do with their lives. We wanna show them that there's this incredible rich profession that they can be a part of.\n\nSo figuring out how we get in front of them, and then staying engaged on campus. And we are lucky, we have incredible leaders in this . Firm leaders like yourself who we can call at a moment's notice, who will go spend an entire day on campus, meeting with our students, [00:06:00] meeting with the deans, meeting with the professors.\n\nWe have as much of an obligation to train our people when they get here, as we do to make sure that the universities understand what is expected of these students so that they can be successful when they get here. And then the third, which I know is near and dear to your heart. Is we can't ignore this incredible breadth of liberal arts students.\n\nThere are students everywhere who have incredible analytical minds who will do great work across our firm, whether it's in accounting, whether it's in consulting, whether it's in tax, and we just need to bring them in and train 'em. So the onus is on us to make sure that we can focus on that skill development and drive the right skills and give people the right opportunities.\n\nWe just need to find intellectually curious, smart people to join our firm, and we can't be really rigid around where we find them.\n\n**Kathryn Kaminsky** (Host): And I think it's sort of being brave, being bold, taking that job and working with the universities to make it doable so that they can become accountants.\n\n**Yolanda Seals-Coffield** (Host): No, it makes a huge difference.\n\nSo we had a recent PWC study that said 84% of leaders are confident in their [00:07:00] talent and capabilities, but many struggle in keeping up with the fast paced market environment. And we talk a lot here about market speed, right? So the market speed to execution sometimes can feel as if you're walking a tightrope and balancing rapid decision making With strategic focus, and I know that this is probably where you spend 80% of your day, how do you advise our clients?\n\nHow do you tell companies to stay agile in such a fast-paced environment?\n\n**Kathryn Kaminsky** (Host): It's so interesting 'cause if you think about sort of the last five years, the only consistent thing has actually been change, right? And the, and the rapid pace of change, including on the talent side, right? Going from the great resignation to a bit of a market slowdown, and then the external impact of what's going on.\n\nAnd so I always say like, you need . To plan to go fast, but also sometimes plan to go slow. Mm-hmm . Right? And we always have this conversation. Do you have to be first to market or is it okay to be second to market on certain things [00:08:00] and sort of taking the time. For planning in a fast-paced environment.\n\nSounds counterintuitive, but it is important, right? Mm-hmm . You've gotta sort of slow down. Is this the thing we need to do and who are our stakeholders to make sure that we're not actually making it harder on our stakeholders? And you know, we have many stakeholders and so do many of our clients and our people as a big stakeholder.\n\nAnd I think sometimes we can get confusing, right? So I think planning, you're gonna have to take risks. You have to learn from the risks. If for one, you did right and one you did wrong, what did you do differently? How did you do it? And sometimes also we talk always risk, but there's also sometimes a risk of doing nothing and making sure that you're looking at that risk in the same way.\n\nSo all those things coming together. But I think that the last point I'd say on all of this is transparency is the most important thing. Mm-hmm . The more transparent you are. With your different stakeholders, you really have not much to lose anymore because you're at least telling them what you're thinking, where you're going.[00:09:00]\n\nIf it was a good decision, it was. If it wasn't like, although you had their back 'cause you told them what you were doing. Right.\n\n**Yolanda Seals-Coffield** (Host): Being transparent about some of those failures is important as well. Right.\n\n**Kathryn Kaminsky** (Host): Totally. I mean, I'm a big believer, like you see in some of my notes, we talk a lot about wins 'cause obviously the commercial side.\n\nBut I sent a note out the other day talking about what are our themes from losses. 'cause you can learn a lot from, to your point, failure. So that's how I think about it. Yeah. That's great. I'm gonna go to you with a question. We talk about it a lot as a team as well, and you talked about, you know, our responsibility and so did I about upskilling our people.\n\nSo it is more important than ever and we're seeing that. But I guess when you think about it. And upskilling, you need to think about three to five years. So what do you think the next critical skills will be in that period, and how do you get your teams energized to think about long-term business goals?\n\n**Yolanda Seals-Coffield** (Host): Mm-hmm . That's a great question, Catherine, because there's a time where you could say. These are the five skills that people are gonna need to be successful and we know exactly what those are. I think if we're really honest with ourselves today, we don't know exactly what those five tangible hard skills are gonna be.\n\n[00:10:00] But we do know a couple of things. We know that we need Agile learners, so we know that skills are gonna continue to be at the forefront. And more and more we are becoming a skills first organization. So as you look at over the next three to five years, your actual title and role will be . Far less important than the collection of skills that you are developing along the way.\n\nBecause what's gonna be important is not only your ability to develop and show proficiency in those skills, but then for those skills to be transferable for you to do something else. So as the needs of our clients change, as the market continues to move at such a rapid speed, and as you've said, the only thing that has been consistent is change.\n\nHaving agile learners is gonna be really important. So we look for people who are deeply passionate about learning, and we're really lucky. I mean, we are really, really lucky. We onboard around 15,000 people a year, many of them from college campuses. They are so inspired to learn. They are learning agile.\n\nThey are inspired to continue learning. And those people make great fits in our organization. So having people with a natural love of learning, having a nimble workforce [00:11:00] where you can switch and pivot what they're doing really quickly is gonna be really important. And then I think really thinking about an understanding skills, because there are incredible skills that people develop in the audit side of our business, as you know really well.\n\nThat transfer beautifully to the consulting side of our business and vice versa. And so thinking about those skills and not so much in a linear way around how that grows and propels someone up this direct ladder, but how we move people across our organization so that they're getting great experiences, our clients are getting the benefits of their experiences, and they're continuing to grow and upskill along the way.\n\n**Kathryn Kaminsky** (Host): I love that. I think . You also have to have leaders that are open-minded who are willing to take the people. Right. And I think that's another area you're so great at pushing us on.\n\n**Yolanda Seals-Coffield** (Host): I think you're absolutely right. And one of the things that's really making these skills conversations even more tangible is the intersection between these skills and ai.\n\nAnd so you were out at Davos, and I understand that AI was a big topic of discussion. There's so much going on in the technology space, [00:12:00] and it's not just about adopting new technology, but it's about equipping our people with the right skills to do it effectively. So when you think about driving our AI strategy, and that falls within the space that you're responsible for in the firm.\n\nHow do you get our people and our teams to embrace the skills that they need to work alongside AI and technology?\n\n**Kathryn Kaminsky** (Host): Yeah, I mean, it's a topic that's everywhere and we use the word intrinsic 'cause it really is in everything that we do. And we're also very focused on the workforce as a whole with the impact of AI on the more commercial side of our, like how do we help clients do this?\n\nAnd I think the one thing that scares people is people talk about the technology. I think one thing you hear a lot from us is it is human led. So I think for us the focus is putting the technology first in the right hands. So what I mean by that is, you know, we have a significant workforce who is less tenured, really intellectually curious, and they've been fiddling with different technologies.\n\nMm-hmm . [00:13:00] So one is making sure that the right people get access to the technology, not thinking about it just in a linear way that, you know, as you go from hierarchy down, they should get it. It's probably actually a bit of the opposite. And giving those people the freedom. To manipulate, to challenge themselves.\n\nThey also do a lot of the work and like you want them to feel part of it to say, how can I do my work differently with the use of this technology, with the right, obviously parameters of risk and having a lot of citizen led teaching, right? And then also to think about our talent pool differently in the sense that maybe tomorrow.\n\nAI will be doing the task, but they're needed because they need to do something different. They may be coaching differently, so it's really embracing it in the system to make sure that people feel that they're part of it. I heard a term the other day, and I don't think actually if I've told you yet, called FOBO.\n\n**Yolanda Seals-Coffield** (Host): Hmm.\n\n**Kathryn Kaminsky** (Host): The fear of being obsolete. FOBO.\n\n**Yolanda Seals-Coffield** (Host): FOBO. Okay.\n\n**Kathryn Kaminsky** (Host): And that people feel it. And if people feel that they're gonna be obsolete, they're not gonna [00:14:00] embrace technology to go to where we need to go. So they need to feel part of it. And so that to me is so important in having the discussion. Again, I think transparency matters.\n\nIt really does to be transparent to your teams to say, these are the things we're doing, this is what we're thinking about. How do you think about it? Where should it go? And actually, the one thing I'll end with is you also have to be able to teach the technology, right? How to use it. I think there's a lot of people who think they know how to use it, but I think things are moving so rapidly that you need someone who understands the technology, who also is willing to challenge the status quo.\n\nI couldn't agree more. So with technology and society evolving so fast, right? Change. Mm-hmm . How can companies create and build a culture of continuous learning and curiosity, and how do leaders support that mindset?\n\n**Yolanda Seals-Coffield** (Host): So one of the things that we've thought a lot about is how you personalize learning. So to your point, if we are going to.\n\nKeep up with and understand how to leverage technology to help us do our jobs [00:15:00] better, to help us serve our clients better. We have to remain agile in the way that we learn. We have to remain intellectually curious, but it can be a bit overwhelming to people. There's so much out there and it is rapidly changing, and we're trying to do our day jobs and keep up with learning and continue to upskill and invest in ourselves.\n\nSo what we've thought a lot about is how do you personalize that learning for people? How do you create platforms? Forums where people can go in and identify the areas that they need to focus on and also the areas that they want to focus on so that they are using their time wisely. They're investing in themselves in a meaningful way.\n\nAs organizations, we have to be ready for that rapid shift and change in learning. So we need to create the bootcamps. We need to create the opportunities we need to bring our people together in meaningful ways. And then the third thing I'd say is . We must never forget that the very best learning occurs on the job sitting next to someone.\n\nRight? And so that apprenticeship model that has been so core to our business and so core to the business of so many industries should not be forgotten and cannot be replaced [00:16:00] with technology. I'm gonna learn about having that tough conversation by sitting next to you and watching you have that tough conversation.\n\nAnd so we wanna make sure that we build in, in a really integrated way that apprenticeship learning environment.\n\n**Kathryn Kaminsky** (Host): I think it's interesting, the soft skills. Mm-hmm . Or leadership skills, the importance of that teaching in this environment is incredibly important.\n\n**Yolanda Seals-Coffield** (Host): I think that's right. I mean, you started when you talked about technology being human led, right?\n\nYeah. So we can't lose those human skills as we start to lean into the different technologies because the technologies will change, but those skills will be with us all the time. Yeah. Yeah. When we think about human skills, one of the core ways that we develop . Incredible human skills is through mentors.\n\nYou are a mentor of mine. You have benefited from great mentors. I think mentorship is a really, really powerful tool as we think about future proofing our talent and nurturing our future leaders. So how can mentorship in your mind, help build connections and inspire growth in our organization and in any organization?[00:17:00]\n\n**Kathryn Kaminsky** (Host): Mentorship goes back to the leadership human skills. And I'm gonna hit your question in Twofolds. 'cause there's mentorship and then there's advocacy and they're different. And especially in a people led organization, you need both. So I think for me, and this sounds so simple, and so it's not all that sexy is like lead by example.\n\nMm-hmm . Like if someone was good to you. Be good to someone else. And our responsibility as leaders and mentors is you don't always have to mentor the highest performer. 'cause actually, you know what, that's kind of easy. Mm-hmm . Right? You need to find someone who you can see huge potential in that probably just need a little bit more help for different reasons.\n\nRight? Some of it is environmental. Some of it is just where they're working doesn't match them perfectly, but you see that and you take the time to, first of all, sit with them and spend time with them to talk about what do they wanna do, where do they wanna go, where do they wanna see, and that they feel like The point for me, for a mentor has gotta be a place that they feel is a [00:18:00] safe space to get some help.\n\nwhen they need it. Yeah. And to get that encouragement in there versus advocacy, which is different, right? Where it's that person who pushes you that extra step and they're not always the same. Like I had great mentors and I had great advocates. Those advocates like kicked me, but they not only kicked me to go up that hill, they were there to catch me if I had problems right, to challenge me to go further than I felt comfortable going.\n\nBut if I made a mistake, I knew they were there to help me solve my mistake. And both of those, no matter what happens to technology, I think both you and I believe those are the skills that there's really special people who do that. It's inherent in what they do. , but we need to do more. We gotta teach it more.\n\nAnd like it is the place that I think makes the difference between an A plus environment and an A. Mm-hmm . To have those people that you can go to. And honestly, I think it starts with. The work, I always say [00:19:00] this 'cause people ask me a lot of times like, can you be my mentor? Well, I'd love to be your mentor, but I need to build a relationship with you.\n\nI need to know what you do. I need to see how you do it. So like, don't go looking for that person. Like out there. Like don't forget the person sitting next to you. Maybe they're a second year associate and your first year associate at our firm, they can be your mentor, right? They can help you. They've walked in your shoes.\n\nThey know what it's like. So it's something I do feel very passionately about and I'll end with this. I think accountability, . To have you mentor people, have you advocated for people as you're moving through the organization is really important. No organization is great at that, right? It's very hard to count and we all love to count things, but this is one that the future, honestly, of the whole professional world is based on getting really great talent and we're all responsible for it.\n\n**Yolanda Seals-Coffield** (Host): I love that. And that is how you leave a lasting legacy, right? Yeah. Is by bringing people along that journey with you. I also think it's incredible advice to tell people to look for those mentors closer to home. I do think people reach out and they see someone on a [00:20:00] webcast or hear someone on a podcast and they find that person really inspirational.\n\nAnd those are great sources of inspiration, but the people right next to you are gonna be incredibly helpful to you. So I love that we could talk all day. We do talk all day often, but I do think we are out of time. So Catherine, I wanna thank you so much for joining me today and discussing some of these really critical issues around leadership and what leaders are thinking about right now.\n\nThe war for talent is never going to end. It will ebb and flow. But the organizations that are really staying at the forefront and thinking about how they recruit talent, how they develop talent, how they future proof their talent skills are really gonna have a lasting impact. And so as businesses evolve, we are gonna evolve to meet the demands today and tomorrow.\n\nIt's clear that people are really critical to our strategic success. So thank you so much.\n\n**Kathryn Kaminsky** (Host): So I wanna give you a thanks. I think the one thing that . People probably don't know as much as you're my business partner, right? Our firm has people and we have clients, and the relationship is [00:21:00] absolutely, you need both.\n\nAnd so thank you for being my partner to get us to the next stage. And I think I'll end with that Is. What makes our people strategy different, it's linked to our business, and I love working with you, so thank you.\n\n**Yolanda Seals-Coffield** (Host): Oh, thank you. And to our listeners, thank you for joining us on this episode of PWC Pulse.\n\nPlease share this episode with others who might find this conversation helpful. Thanks everyone. See you next time.\n\n**VO**: Thank you for joining us on the PWC Pulse podcast. Subscribe to pwc Pulse wherever you listen to your podcast. Or visit pwc.com/pulse podcast to hear our next episodes. This podcast is brought to you by PWC.\n\nAll Rights Reserved. PWC refers to the US member firm, or one of its subsidiaries or affiliates, and may sometimes refer to the PWC network. Each member firm is a separate legal entity. Please see www.pwc.com/structure for further details. This podcast is for general information purposes only and should not be [00:22:00] used as a substitute for consultation with professional advisors.\n\n",
    "audioLink": "",
    "wordCount": 4629,
    "extractedAt": "2025-10-28T05:15:29.732596",
    "keyTopics": [
      "Leadership",
      "Technology",
      "Healthcare",
      "Business Strategy",
      "Career Development",
      "Culture"
    ],
    "notableQuotes": [],
    "summary": "In this episode of PWC Pulse, Yolanda Seals-Coffield, Kathryn Kaminsky discuss key topics including Leadership, Technology, Healthcare. The conversation covers insights from experience at PWC."
  },
  {
    "id": "20250204-MBS-0506-V1",
    "fileName": "20250204-MBS-0506-V1",
    "date": "2025-02-04",
    "series": "MBS",
    "episodeNumber": "0506",
    "episodeTitle": "My Best Shift podcast",
    "hosts": [
      "Chantée Christian"
    ],
    "guests": [
      "Ramall Johnson"
    ],
    "guestWorkExperience": [
      {
        "name": "Ramall Johnson",
        "title": "Branch Manager",
        "company": "Wells Fargo"
      },
      {
        "name": "Ramall Johnson",
        "title": "Store Manager",
        "company": "Apple"
      }
    ],
    "transcript": "\n\n**Chantée Christian** (Host): Welcome to the Mya Shift podcast. I'm your host, Chantée Christian. In today's episode, I'll be talking about purpose, faith, and the power of staying true to your calling with Ramall.\n\nHi Ramall. How are you doing today?\n\n**Ramall Johnson** (Guest): Fantastic. How are you?\n\n**Chantée Christian** (Host): I'm doing great. So before we get too far into our conversation today, why don't you tell the people a little bit about yourself?\n\n**Ramall Johnson** (Guest): Sure, absolutely. Uh, my name is Ramall Johnson. I currently live in Houston, Texas. Uh, but I'm originally a native of Louisiana. I've moved to Texas. Probably about 15 years ago or so. So been here that time. Currently I work with Wells Fargo as a branch manager. Been with those guys for five years, for the decade.\n\nPrior to that, I actually ran an Apple store out here.\n\n**Chantée Christian** (Host): Oh, every time you say Apple, I get excited. Wells Fargo, maybe not so much, but I won't go there today. , and I think that it's really cool with how we [00:01:00] met because . I wouldn't say that it was expected. , why don't you tell, tell them your version of how we met and then I'll tell my version of how we met\n\n**Ramall Johnson** (Guest): I notice how you put that, my version and your version. Let's just go with the true version, which will probably be mine. Oh, uh. On there. Oh, uh, well, for the people who don't know, we were at a conference, it was actually a church conference out here in, in Houston, Texas. And this conference had tons of people who were there.\n\nAnd so as we get there, everyone's checking in, they're trying to get organized to see where the lions are. I happen to see someone causing a ruckus in line. I won't say her name, but she's running this podcast right now. And so lies me. I. I am a natural character. So, you know, when I see people with that energy, I'm kind of drawn to them.\n\nSo, you know, I'll be truthful. I got in line and I started being messy and, you know, just picking with them and the people around and, and really just having a, a great time. [00:02:00] But from there, disconnection was formed and it's been like that ever since, so...\n\n**Chantée Christian** (Host): you know, . Perception is real. Mm-hmm . Okay. Because actually our mutual friend who is also a former podcast guest and friend of the podcast, JD and I were at this conference together.\n\nMm-hmm . And she was walking up to people randomly asking them if they knew where we were supposed to go. . To get into the building. You just so happened to be one of those people that she walked up to, and then the foolishness ensued. I was minding my business .\n\n**Ramall Johnson** (Guest): Ah, ah, you, you were an innocent bystander.\n\n**Chantée Christian** (Host): Always, always\n\nand, and then next thing you know, she's sitting there telling you all of my business. And I was like, damn.\n\n**Ramall Johnson** (Guest): Mm-hmm . I Hell she did.\n\n**Chantée Christian** (Host): And so when she listens back to this, I'm sure she's gonna have her version of the story too.\n\n**Ramall Johnson** (Guest): Correct? Correct. Let, let's give her a shout out. What up jd?\n\n**Chantée Christian** (Host): Always, [00:03:00] always What I loved about the conference, because yes, it was a church-based conference, however, it was heavy on walking in your purpose.\n\nMm-hmm. Right? It was heavy on releasing the things that have been holding you back in order to be true to what you've heard. Right. And when I say what you've heard, what you've heard from God, what did you actually hear him say? And how are you moving in that? And through that I learned that you had this desire to write mm-hmm\n\nAnd we had like these amazing conversations about your ideas around children, books and all the things. And so when I had the idea for awareness, put me on, it just felt like . Of course moment that you would be in awareness. Put me on. I'm curious because what, it's been two years, I guess. Mm-hmm . Mm-hmm\n\nSince then. And so when you think about your life and how things have transitioned and transformed over [00:04:00] that time, what's been going on with you?\n\n**Ramall Johnson** (Guest): Ooh. Yes, there's definitely been a lot that has been going on. You know, from that time I've since gotten married, so, got married at the end of last year, uh, in November.\n\nBeen doing a lot of traveling as well. Also, my wife and I, we opened up two. Additional businesses as well that we're currently working on right now. You know, we are working on an invention that we patented. There's two patents on it right now. So in the process of getting that up and running and out in stores also, so definitely a full life and honestly attempting to, as you said, walk in that purpose.\n\n**Chantée Christian** (Host): Mm-hmm . So if you were to articulate your purpose mm-hmm . For us, what would that be?\n\n**Ramall Johnson** (Guest): As in us? Give me that. My personal purpose in terms of what I feel God has me for. Yeah.\n\n**Chantée Christian** (Host): I mean, listen, we're here.\n\n**Ramall Johnson** (Guest): Yes.[00:05:00]\n\n**Chantée Christian** (Host): We are here. So whatever it is that is coming up, that's what we wanna know.\n\n**Ramall Johnson** (Guest): Absolutely. So for me, you know, honestly, I have always, even as a child, as I wrote in a book, I was never that individual. When you ask, you know, what do you want to do? Or what do you wanna be for a living, there was never an answer that I had that felt genuine or felt true to myself.\n\nNot that I couldn't do it. So you asked, do you wanna be a doctor? I could say, yes, I could do it, but that never felt right in my heart. Attorney astronaut, firemen, all those things you say never rang as part of my purpose. Mm-hmm . The one thing that honestly was clear and evident in everything that I did was I wanted to help people.\n\nIn some capacity, I wanted to be able to help, whether that's inspire people, whether that's motivate, whether that's provide direction, whether that's be that little push in that moment when they may have this just inkling of doubt that's there, that's about to take seed, to hopefully be the one to help kind of yank that up before it takes root.[00:06:00]\n\nAnd so for me, everything that I do has been guided in terms of how can I help someone and truly help them. So, you know, one of my personal philosophies is anyone who is in your life right now, I. If you are not a positive influence in them, whether that's physically, mentally, spiritually, financially, emotionally, if their life is not better because you're there, then why are you there?\n\nI. And, and that's the way that I try to live my life every single day. That's also in terms of how I look at the people who are in my life. I wanna make sure that I'm surrounding myself with people who add value to my life. There's enough craziness and negativity in the world that you don't need to bring that into your inner circle.\n\n**Chantée Christian** (Host): Yeah. I love that. It also reminds me of an offline conversation that we've had around Job and around just how it applies to now, right? And how it applies to staying steadfast, because I think about purpose. [00:07:00] And as a coach, a lot of people come to me like, how did you know ? And I'm like, it didn't happen overnight.\n\nAnd there was a lot of resistance to it, right? It was a whole, whole lot of resistance because I. That wasn't what I saw to be true. It wasn't that I didn't believe it to be true. It wasn't that it didn't happen over and over again as proof of truth . Mm-hmm . But my acceptance of the truth was different.\n\nRight. And so when you're talking about you never were the person to be like, oh, I wanna be this when I grow up. Well, when did you realize that inspiring others and being of service and being in community was something that you were able to do without being a title?\n\n**Ramall Johnson** (Guest): Very good question. Uh, you know, honestly, as, as I think back to it, I think back to kind of how I was reared, how I was brought up, my grandparents played [00:08:00] a big role in my upbringing along with my mom, and they all had this servant mentality and my entire life, I grew up seeing them help people.\n\nI grew up seeing them. It didn't matter how exhausted they were, how tired they were, they would always be willing to help people, and that's something that was instilled in me observing that as a child. It just was naturally a part of what I expected you were supposed to do. If someone needs help, you help.\n\nYou know, someone would go to my grandmother and nearly me, or my grandfather Carol, or my mom, Loretta, and they need help. Guess what? They got help. It didn't matter. If they were exhausted, didn't matter. If they were tired, didn't matter. If they had just worked a 12 hour shift, if they had the capacity to help, then they would help.\n\nAnd so for me, that was kind of the natural flow of, of what I saw. And as children, we often imitate what we have seen, which is why it's definitely important that we are setting the right exam for our kids. And so as I matured and got older and really having [00:09:00] a different career path. That I've taken throughout my lifetime.\n\nI mean, I've, I've done everything from mortgages to sold million dollars worth of chemicals to running an electronic store financing as well, and that true north in every single one of those endeavors. There's been certain people that I've been drawn to, that I've gravitated to, that I've been able to hopefully help the strangers who I've met that honestly, even after having conversations with them, they would literally tell me.\n\nI don't know why I initially came here today. Mm-hmm . But I'm glad I did. And there was something that I was able to hopefully share with them that helped them. And again, that just goes part of just what I've always believed. I think that everybody you meet, there's usually a couple things that's supposed to happen.\n\nThere's something you're supposed to learn from them. There's something you are supposed to help them with as well. And as long as you're doing those two things, then you're moving in that right direction.\n\n**Chantée Christian** (Host): Ooh, I like this. So, okay, so stay there for a second. Mm-hmm . So those two things. [00:10:00] Everyone that you meet, you're supposed to help them with something.\n\nAnd what was the, say it again.\n\n**Ramall Johnson** (Guest): There's something that you're supposed to learn from them. Okay. It should be a almost symbiotic relationship, and that could be something that you learn about them, or honestly, something that you learn about yourself.\n\n**Chantée Christian** (Host): Okay. Okay. Okay. So, because you know why not?\n\n**Ramall Johnson** (Guest): Mm-hmm\n\n**Chantée Christian** (Host): So our relationship, us Yes. From what you know now. Mm-hmm . Right. How would you apply us to that?\n\n**Ramall Johnson** (Guest): Absolutely. I could tell honestly from the very first time we met. And I really think back to those conversations we had literally from the very first conversation we had sitting down after that first session and it was over with, and we went to that little spot.\n\nIt was just a group of us and we sat there and talked, and I heard your passion from what you do. I literally, I heard it and it was almost that you could not just [00:11:00] hear it, but you felt it. And, and you really saw an individual who was committed to the career path that they have chosen, that they were in this mode of conquering the world, uh, which I, I know you're still in and, you know, seeing that is inspirational.\n\nLike I told you, I always try to surround myself with people who. Add to your life. And so the people who I choose to surround myself with are individuals who they may be excelling in different areas of their life, or they may have that fire or that drive that you see it. Iron sharpens iron, and you want to be in association with those individuals who are driven like that.\n\nSo for you, what I took away from it is that drive that you had, that fearlessness that you had as well. I don't even wanna say fearlessness, because you will have fear. , but you will push through it. Mm-hmm . And you're willing to take those actions and those steps to push through it to achieve whatever that goal is that you were looking to accomplish.\n\nI saw the work ethic that you put in, like you literally wearing [00:12:00] 27 hats, doing 97 things at the same time. So all of those were things that, as I see them. And things that as I look at those qualities that help make people successful, those are some of the things that I definitely attribute to you and people are successful.\n\nAnd so again, seeing that and observing that, those are qualities that I'm like, you know what? I love that. Let me observe. Let me be that sponge kind of steal and take away from that as well.\n\n**Chantée Christian** (Host): I love that and we're gonna be using that as a clip, just to let you know.\n\nNo, I really do appreciate that. And I remember that night too, and it's always interesting what people see and what people hear and what people feel because I. I felt in that moment. Right. Full transparency that I was up against a wall. Mm-hmm . I felt like I was fighting for my life in the eighth mm-hmm round.\n\n**Ramall Johnson** (Guest): Mm-hmm .\n\n**Chantée Christian** (Host): And what you saw as passion .\n\n**Ramall Johnson** (Guest): Mm-hmm. [00:13:00]\n\n**Chantée Christian** (Host): I heard and felt as desperation. Mm-hmm . And so that is a reminder to me too, that just because I'm experiencing something mm-hmm . Doesn't mean that it's still not beneficial for someone else in one way, shape, or form. But it looked like you were about to say something.\n\n**Ramall Johnson** (Guest): Yeah. I want you to think about, so we talked about what I took from you. Mm. What did I say my purpose was for me?\n\n**Chantée Christian** (Host): To help people.\n\n**Ramall Johnson** (Guest): To help people, yeah. To literally see, so with you, I felt that too. So I felt like you said that sense of desperation, but that was small compared to the passion that I saw. Sure.\n\nAnd for me, I knew there are always moments in life that we have where we will sit there and we will question, can I do this? Can I do this? Like I, I've been trying, I want to get this done. Do I have it within me to continue pushing? That is a critical moment in most people's lives. Mm-hmm . And what a lot of people [00:14:00] don't understand is who you surround yourself with in those moments can either determine your success mm-hmm\n\nOr be the excuse for your failure or quitting. For sure. And so for me, seeing you, I felt that that was a moment for me to hopefully. Speak life and not just speak life, but honestly hold up the mirror. Yeah. 'cause I think there are times where we get so just engrossed in everything we're doing and there's that old scene, you can't see the forest for the trees.\n\nMm-hmm . And everything that I saw you because you were focused, like we said on 27 things. You did not see the totality of all that you were. And so for me, the only thing that I try to do with you is even in those moments is, you know, how could I be encouraging, how could I be uplifting? How could I push to be you?\n\nDo you unapologetically? Do you.\n\n**Chantée Christian** (Host): Yeah. No, and I appreciate that. And I remember that too. Mm-hmm . Because I remember saying, okay, maybe I won't go burn down their building. 'cause anybody that knows me knows I'm quick to say, I'm gonna go burn something down. I'm really not. I know only [00:15:00] thing I'm burning is some candles and some sage, maybe a little palis Santo\n\nBut that's one of the first thing I'm like, I wanna burn it down. 'cause I feel like when you burn things down, it gives it the opportunity to regrow. , ,\n\n**Ramall Johnson** (Guest): unless you get arrested first. ,\n\n**Chantée Christian** (Host): you know, I mean. Small things, , small things. No, but it's also one of those moments where I think it's important to remember that if you're really walking in your purpose\n\n**Ramall Johnson** (Guest): mm-hmm.\n\n**Chantée Christian** (Host): It's not always roses and rainbows and butterflies. Mm-hmm. Mm-hmm. And when you have an opportunity. So I started off saying, JD told you all my business when she sat down. Mm-hmm . And I was like, uh, ma'am. , because I believe in, so I believe it down to my core that you gotta be so careful mm-hmm .\n\nWith who you share your vision with.\n\n**Ramall Johnson** (Guest): Absolutely.\n\n**Chantée Christian** (Host): Especially when you're on rocky terms.\n\n**Ramall Johnson** (Guest): Absolutely.\n\n**Chantée Christian** (Host): And part of me going to this conference for me [00:16:00] was to get. Stable 'cause I felt mm-hmm. Really waffly and not about my purpose, but am I supposed to be doing this right? Is this really the calling that I heard mm-hmm . Or is this a calling that I made up?\n\nIs do I have pieces of it? Mm-hmm . Am my playing is small or like all of the things. And for those listening, I was getting ready to record for. The TV show , right? So we were a month away from recording for the TV show, and I had all of the angst that could come along with preparing and just being in a space where holy smokes, like I get the opportunity to go do a TV show.\n\nMm-hmm . Say what? Say who, how, when, where? And then I was supposed to have all those answers. , . I was like, in the hell is this?\n\n**Ramall Johnson** (Guest): Heavy is the head that wears the crown.\n\n**Chantée Christian** (Host): My God. And I wanted to put the crown down. Okay. Okay. And so I remember that. But I also remember clear as day, you saying, well, [00:17:00] what's stopping you from doing it?\n\nI was like, oh, well let me tell you,\n\nHowever, as I was saying it, I was like, okay, wait a minute. These aren't really barriers. I mean, some of them felt very barrier, like mm-hmm . However, they weren't things that were gonna stop me from doing what I had already committed to. Mm-hmm . What I had already said that I would do and how I would do it, and all those things.\n\nRight. And so what our conversations throughout that weekend did, were . Help me to reprioritize and reinfuse me into the process because I had gotten so bogged down and these are all the things I gotta do. This is just my God, somebody come else. I don't have anybody else. I don't have money for everything else.\n\nAnd to get out of the what I don't have and then really focus on what I do have.\n\n**Ramall Johnson** (Guest): Mm-hmm .\n\n**Chantée Christian** (Host): So that part, I, I really do [00:18:00] appreciate that. And I just, I remember. Just that whole conference, like I left there sick, the only person out of a, I don't know, 10 person crew, sick, and I was like, how does this work, ? I was like, well, hey, God, you're detoxing me.\n\nMm-hmm . I guess that's what it is. Mm-hmm . , but no, I do, I recall that and I, I also recall you having. Which I mentioned earlier, a vision\n\n**Ramall Johnson** (Guest): mm-hmm .\n\n**Chantée Christian** (Host): That we talked about. And if I recall correctly, what have you done with said vision?\n\n**Ramall Johnson** (Guest): Uh, that vision is still going. Okay, so I, I have still been writing and truthfully, with the.\n\nJust where we're right now. I think it's honest. It's more than important than ever being able to empower kids to see themselves. Mm-hmm . Throughout not just this world, but throughout history and truly understanding the contribution that our people have made to this world. And regardless of whether or not that's shielded [00:19:00] or that's hidden, we have to\n\nProvide those avenues for kids to learn that and provide it in a way and a manner in which they can not only see the story, but see themselves in the story, and there's an inspiration that comes from that, and kids are willing then to maybe fight through some of the adversity that they see.\n\n**Chantée Christian** (Host): Yeah. I think it's important too, because I kind of like how we were talking about earlier, I had never seen someone look like me with my background, do the things that I have been talking and dreaming about doing.\n\nMm-hmm . And so there wasn't this wild space of it's possible.\n\n**Ramall Johnson** (Guest): Mm-hmm .\n\n**Chantée Christian** (Host): And so for you to author books and create spaces where youth can see themselves, I think is really impactful because the buzz words around representation and seeing yourself Yes. And. It really is important to be able to see yourself in spaces [00:20:00] to even dream or know that they're possible.\n\n**Ramall Johnson** (Guest): Mm-hmm . Absolutely. I can look back honestly through my life and they were key individuals at different moments in my life that I saw who looked like me, who spoke like me, who had achieved levels of success, that when I saw it, it inspired me. It gave me the confidence that, hey, I could do that too. And not only did it give me the confidence, they also imported that confidence in me as well by speaking life into me and encouraging me to push forward and you know, just, Hey man, you can do this too.\n\nAnd I think that's one of the things that I. Is vital, especially with kids coming up, and not even kids, but even adults, a certain standpoint too, because adults have those same fears, they have those same doubts, and if they have not seen an example of an individual who's doing it, especially one who looks like them, then there's this belief that, oh, I can't do that, or That's beyond my reach.\n\nAnd the reality is nothing is beyond your reach. Because if you're willing to put work to it, and [00:21:00] if God has it in his plan for you to do, then that's something that can happen. We just have to have that fate to push forward and to do the work to gain the knowledge and press on until we get to it.\n\n**Chantée Christian** (Host): Yeah, I, I agree.\n\n\nI feel like God has a funny sense of humor. That's not really that funny sometimes. Oh, oh, he does.\n\n**Ramall Johnson** (Guest): He does.\n\n**Chantée Christian** (Host): And so I feel like sometimes it is less of us doing the work and more of us being obedient.\n\n**Ramall Johnson** (Guest): Mm-hmm . Mm-hmm .\n\n**Chantée Christian** (Host): Right. Because sometimes he just wants us to do a thing.\n\n**Ramall Johnson** (Guest): Mm-hmm .\n\n**Chantée Christian** (Host): And if we do a thing, then everything else opens up.\n\nSo often , we are afraid to give up something, right? Mm-hmm . So the sacrifice that comes along with the obedience of it all. And so we don't, or we have give [00:22:00] up something and then wonder why on the other side the reward doesn't seem like we thought it should or mm-hmm . The favor isn't where it ought to be.\n\nAnd a lot of times it's because we didn't do what we were told to do. Right. And so there was a time where I thought hard work, . meant that you get certain levels within organizations. It meant that you got certain recognition. No, no, no.\n\nyes. You work hard. Mm-hmm . Yes. You have a hard work ethic. Mm-hmm . However, to what extent are you obedient?\n\n**Ramall Johnson** (Guest): Mm-hmm . Absolutely. For me, I love that too because I've always said this, that God will never send your blessings to where you are. He's gonna send your blessings to where he told you to be. Oh. And if you do not move where he tells you to be, then those blessings is not there, not there.\n\nThey are where they're supposed to be. [00:23:00] You just aren't aligned with what he told you to do. And a lot of that comes with obedience. A lot of that comes with, you know, as you shared, we often think that we can work our way to it. We've all have that Frank Sinatra complex I call it. I did it my way and we think we can move forward, push through it and get to it.\n\nWhen God told you. Do this one thing. Yeah. And when you do that one thing, as you shared, those other doors will open up for you. And not only will other doors open up for you, but when you, and this is, we are gonna go a little bible now in the back two, two it says, write division and make it plain. So that others who see it will run with it.\n\nSo when you are clear in terms of what you're trying to do, there are other people who will come alongside you, not only support you, but push you and run with you as you're doing it. But a lot of that comes with obedience. And it's a matter of, okay, God, I know this is my what I want, but is that what he wants?\n\nAnd if your want doesn't align with his want, which [00:24:00] want is going to win out, 'cause only one is gonna work out good for you. And that's a choice we all have to make internally with ourselves.\n\n**Chantée Christian** (Host): Yeah, I like that. I love the part B of that scripture because so often we only stick to the write it down and make it plain, right?\n\nMm-hmm . And forgetting . That the write it down and make it plain isn't for us. Mm-hmm. It's for the other people to understand so that they too can come along. And it's a reminder to me for a few things that I got going on. However, it's also even when you were talking about when we first met. Right. I had wrote it down and made it so clear.\n\nThat when I was able to articulate it in a way that there was no mistake about what I was doing. Right. Even though I may have been feeling wly, I was on solid ground, you know?\n\n**Ramall Johnson** (Guest): Right. There's one other thing too about that, as you mentioned, that feeling of of wly, I've always believed this, if [00:25:00] your dream is small enough that you can accomplish it on your own.\n\nIt's not a dream. That dream has to be big enough that it scares you and it has to be big enough that it requires God to step in and do what only he can do. Mm-hmm . Because I don't think he ever intended any of us to play small. Mm. He gets no glory by us being small. Mm. He gets glory by us magnifying his name.\n\nDoing the work, impacting the world positively. And through that, allowing people to see what he's able to do in not only our lives, but by extension their lives. Mm-hmm .\n\n**Chantée Christian** (Host): Who in the world thought we were gonna have Bible study? What in the world is going on now? . .\n\n**Ramall Johnson** (Guest): I got bible study coming up in about an hour.\n\nSo, ,\n\n**Chantée Christian** (Host): what is this?\n\n**Ramall Johnson** (Guest): I'm getting ready.\n\n**Chantée Christian** (Host): And in all seriousness, right, because . I believe that we are, we're not linear, right? Mm-hmm . And so it's also really important to have a full awareness [00:26:00] of where you derive you from. So for people who are not Christians and or not believers, what I want them to hear from this conversation is that you gotta get grounded.\n\nIn your what and understand the why in order to keep going, to keep pushing, to stay in consistency because it's not about perfection. I. It's not about the hard work. I know it doesn't sound like if I, trust me. It's not about the hard work . It is about consistency. Mm-hmm . It is about staying true to who you are when you figure out who you are.\n\nMm-hmm .\n\nWhen you figure out why you're here, when you figure out all of those things. Then what?\n\n**Ramall Johnson** (Guest): Absolutely. You know, for me, one thing that I always do, especially when I'm training my staff, the primary [00:27:00] focus that we have being in the industry I am, which is finance and servicing and helping people, it's really how outwardly focused are you?\n\nAre you really observant of the individuals who are coming in, who you're entrusted to help? Then based upon that, what are those principles that we have set forth in terms of expectations of how you are expected to show up every single day? How are you expected to help these individuals and work with these individuals and really make a positive impact in their life?\n\nAnd that's truly understanding what is the true north? That we have in terms of how we're going to guide and direct every interaction we have. And then once you have that, you have that clear baseline that you can then look at your interactions that you have with people. Okay. Does that align with what that true north is?\n\nYou can look at those activities that you have and do when no one's looking. Does that align with what that . True north is, and that's an integrity thing at that point. You know, are you true to who you say you are? Are you true to who you say [00:28:00] you want to be? And that same person that you are when no one's looking, should be the same person you are when you're on stage.\n\nAnd there's a level of authenticity that comes with that. And you know, some people call it realness, and that's the genuineness that you have. That how you present and show yourself to the world every single day so that you don't feel like you're wearing a mask, but you are genuinely being yourself.\n\n**Chantée Christian** (Host): Yeah, and I love that because when you show up as you, that's when the real magic happens. That's when people are drawn to you. That's when people are . Amenable to what you have to say and how you can be of service to them, and them to you, because every interaction, like you mentioned earlier, has an exchange like how the two people in the conversation or in the interaction are experiencing it differently.\n\nBut that doesn't mean that [00:29:00] both of you didn't take something away from it. And so I think that it's just really powerful to understand how you show up, how it's in alignment with who you are or who you think you are, and being okay and flexible enough to say, there are opportunities for me to make some shifts and some changes here.\n\n**Ramall Johnson** (Guest): Mm-hmm . Absolute. And when that version of who you think you are and who you really are does not align. That gives you honestly a great opportunity to really do some self work and figure out, okay, this is who who I say I wanna be, but let's evaluate who I have been up to this moment, and if this is who I've been and how I've shown up, what are those things that I immediately need to change?\n\nIn order to become that individual. There's a thing that I've done with friends and even with my kids. I'll show you how my mind works. I work backwards. You, I tell each of 'em, I forgot which book I got this from, but it said, [00:30:00] imagine you are telling your own funeral, and there are four groups of people who are gonna speak.\n\nOne is your family, one is your friends, one is your church, one is maybe your coworkers. What do you want those individuals to say about you and how present you were in their life, the impact you had in their life. And when you sit and you think about that, then you work your way backwards to today's time and it gives you a picture of how you need to show up.\n\nI. In those interactions with the individuals at this current time and using that as kind of a guide to help you come to that realization of who you really want to be. Mm-hmm. Because who we are now is the product of our experiences. We've had individuals we've met, whether that's past traumas, past successes, books we've read.\n\nAll of those things have an influence on us, and we are . Beings who are meant to continue to grow, meant to continue to evolve, and we have power over that. And so are we taking those steps to become that individual [00:31:00] who we want to be.\n\n**Chantée Christian** (Host): Because I'm so unserious. As soon as you started listing all those groups and people, I was like, my God, that's about to be a long funeral.\n\nNow what in the southern hospitality,\n\nif anyone else. Don't feel bad. I, I, I instantly went. There was like, my God, that's a lot of groups of people. . We gonna have one representative and they got two minutes. You know?\n\n**Ramall Johnson** (Guest): That's right.\n\n**Chantée Christian** (Host): I was like, woo. I don't know. You know how people do.\n\n**Ramall Johnson** (Guest): There's a lot of love in that room.\n\n**Chantée Christian** (Host): You know how your people do.\n\n**Ramall Johnson** (Guest): I do.\n\n**Chantée Christian** (Host): I know how your people do.\n\n**Ramall Johnson** (Guest): I absolutely do ,\n\n**Chantée Christian** (Host): but I like that it's similar to a legacy question that I typically like to ask around . What is the legacy that you wanna leave? However, when I define legacy, it is not when you're dead and gone. Mm-hmm . It's about the imprints that you're leaving right now.\n\nMm-hmm . And so [00:32:00] when you think about right now, the legacy that you are leaving, the imprint that you're leaving on the world, what is that?\n\n**Ramall Johnson** (Guest): Absolutely. Uh, a couple of things. Definitely. Number one, as you know, I am a Christian. God is the head in the center of my life, and as I continue to grow and continue to evolve, I recognize how little of me there is and how much more of him there is.\n\nAnd so the legacy that I want to leave is that when people see me, they see a flawed individual who continually searches for him. And continuously strives to get better every single day. I don't always get it perfect. Like you said, it's not perfection, but it is progress. Mm-hmm . In daily, making that progress when it comes to that personal relationship that I have with him and hopefully pointing other people towards him as well, whether that's verbally or the example that I live.\n\nThe second thing I would say in terms of that legacy is the people who you have in your life. It's, like I said earlier, how are you showing up for those individuals? Mm-hmm . [00:33:00] How are you there for those individuals in those moments when they need it. Hmm. And even in those moments when they don't need it, or are you making a positive impact, a positive influence in them to where they can look back and be like, man.\n\nI'm so glad I met Ramall. Like I am genuinely glad that he was there in that moment that I needed him, because we all need that. We all need those individuals who are willing to step in in those moments where we don't believe in ourself maybe, or have the strength that we need to push forward. We need that support group of individuals who are there to help.\n\nAnd so when individuals think about me, even in this current day. I want them to feel that and feel that from me, genuine and personal connection that I have built and established with them.\n\n**Chantée Christian** (Host): That's real good Mine isn't as prolific.\n\nI remember Cicely Tyson did an interview and they asked her [00:34:00] essentially like, what's your legacy? Mm-hmm . Or what's the legacy that you're leaving? Something to that effect. and she said that I did a good job.\n\n**Ramall Johnson** (Guest): Mm-hmm .\n\n**Chantée Christian** (Host): And I would say for me, it's not just that I did a good job, but I did what was uncomfortable.\n\nMm-hmm . For me, and sometimes uncomfortable for others. And I still held space. Right. I know that every interaction with me is not a comfortable interaction.\n\n**Ramall Johnson** (Guest): Mm-hmm .\n\n**Chantée Christian** (Host): My job is not to make things comfortable. Right. I am literally a disruptor before I even had a name for it. Like that's what I did. Mm-hmm . And so I understand that with that comes a responsibility and.\n\nI hope that by the time this airs, it'll be the right. So with these 42 years under my belt,\n\n**Ramall Johnson** (Guest): mm-hmm . Mm-hmm .\n\n**Chantée Christian** (Host): As a disruptor, [00:35:00] that people know the intent and can embrace the impact even if they didn't agree.\n\n**Ramall Johnson** (Guest): Mm-hmm .\n\n**Chantée Christian** (Host): And even if they didn't agree, I'm like, excuse me, sorry. That was personal. Yeah. Personal. But like,\n\n**Ramall Johnson** (Guest): no, I love that though.\n\n**Chantée Christian** (Host): Because at the end of the day, I know without a shadow of a doubt that my purpose is to cultivate these spaces. Mm-hmm. For growth. Mm-hmm. For inspired action and for change. Mm-hmm . And in order to do that. There has to be resistance. Yeah. There has to be pushback. Right. And so there, I want some people to be like, well, okay, she gone.\n\nAnd I want other people to be like, you know what, , I remember when. Mm-hmm . She was there, how and where. You know,\n\n**Ramall Johnson** (Guest): I love that. And really you hit it on the head. 'cause growth. I don't think growth ever happens in comfort.\n\n**Chantée Christian** (Host): Oh God, no.\n\n**Ramall Johnson** (Guest): If you are too comfortable [00:36:00] and it's flowing, I promise you, you are not growing.\n\nIf anything, you're probably dying at that point. I. So growth is never a byproduct of living in comfort. And you have to have that agitation, that thing that stretches your thoughts, stretches your expectation of what you think you can do. And that thing that obviously at times would be like, ah, I don't if I don't even talk to you anymore.\n\nYou need that individual, or like you said, that disruption to help you excel and grow. There's one thing my wife Tracy said, and she said it very early on, and I. Paid attention to it, but I didn't. But there was a particular moment where it really stood out to me. She said, you know what Ramall people are watching.\n\nMm-hmm . Is what she said. And what she meant by that is that God has an expectation of who we are supposed to be, how we're supposed to live, and how we're supposed to present ourselves to the world. And I remember we were at a birthday party for a good friend of mine, Adrian and his wife threw him a.\n\nSurprise birthday party, [00:37:00] even though he wasn't surprised because he walked in there dressed to the nines , you know, looking good, . And so we were at this party and they were playing some music and she and I were in kind of this real connection moment where honestly it felt like no one else was in this party.\n\nAnd we're there dancing and laughing and talking to each other, and someone snapped this photo of us in that moment. And neither did she or I see the individual who did it. And it's one of those things that crystallize the fact that there's always a lens on you. Mm-hmm . And how you show up in the world is going to inspire, is going to help, it's going to facilitate change.\n\nUh, you know, having, you know, my two kids, Dylan and Amaya, one thing that I'm always aware of is. How do I look to them? Mm-hmm . You know, forget the world. How do I look within them? Have I lived the life where they see a man of integrity to where they see someone who's had adversity, someone who's had challenges, but someone who's always pushed through [00:38:00] and someone who is willing to continue pushing through for goals and dream and to continue fighting.\n\nAnd so those are things that make up your character and make up who you are. And so I love that you shared that . Information about being that agitator. 'cause I can definitely see that in you. And I think that's honestly one of your biggest strengths that you have as well.\n\n**Chantée Christian** (Host): Yeah. Only child, you know? Mm-hmm\n\nIt's, uh, only child. It does that. It does that. So I feel like this is a great spot to ask you. My last question. Mm-hmm . We've covered a few things. We took the people to Bible study. Mm-hmm . And brought 'em back,\n\nAnd so I'm curious, what is it that you wanna leave the people with?\n\n**Ramall Johnson** (Guest): For me, I always wanna leave the people with, we often hear and see other people do things. We always see individuals from afar, and there are times where you see individuals who've had success or [00:39:00] who've had failure, and there are lessons that can be learned in both.\n\nAnd so for me, the thing that I would always leave to people is, you know, when you evaluate your life, when you look at what you hold value. With whether that's successful individuals you've seen or whether you have trauma or things that you've struggle with throughout your life, what are those lessons within each of those that you can gain and learn from to help you continue to move forward?\n\nBecause it is about continuing to move forward. It is about, regardless of what climate is going on in the current world, how do you move forward with becoming your full and authentic self and really becoming that individual who . You when you were a little child, you made that promise to yourself that this is who I am going to be.\n\nIt may not have been a particular career, but it may be who the type of person you wanted to be and people love. I. So how are you really striving in moving forward to that? [00:40:00] And I would say for the people who are out there, honestly man, look at that every single day and look at that and celebrate those little wins too.\n\nA lot of times we get so bogged down with wanting that massive victory and we don't realize that I made a little bit of growth every day over the last six months. And when you look at how you were when you first started, it's completely different. I would even say to you, if we go back and we have that conversation that we had in the beginning, how you were with the TV show, that pressure you felt, I would venture to say right now, that wouldn't even be the case.\n\nYou would probably get in there and get it done and be ready to move on to the next. And I think with us, as we continue to grow and evolve, or we continuously pushing ourselves to move closer towards who we want to be and who we should be.\n\n**Chantée Christian** (Host): Mm. That's good stuff. Thank you for being on my podcast with me.\n\n**Ramall Johnson** (Guest): Absolutely. I'm glad I made the cut.\n\n**Chantée Christian** (Host): Yeah, . It's always one. It is always one. . [00:41:00] I enjoy talking with Ramal about embracing obedience, walking in faith, surrounding yourself with the right people and how it can shape your journey. Thank you for joining us and remember to stop doing shit. That doesn't serve you for more information or if you'd like to reach out to us, visit at My Best Shift, LLC on Instagram.\n\nSee you later.\n\n",
    "audioLink": "",
    "wordCount": 7690,
    "extractedAt": "2025-10-28T05:15:29.748016",
    "keyTopics": [
      "Leadership",
      "Technology",
      "Healthcare",
      "Business Strategy",
      "Career Development",
      "Purpose & Faith"
    ],
    "notableQuotes": [],
    "summary": "In this episode of Mya Shift podcast, host(s) Chantée Christian interview Ramall Johnson key topics including Leadership, Technology, Healthcare. The conversation covers insights from experience at Wells Fargo, Apple."
  },
  {
    "id": "20250205-nih-153-V1_TRX",
    "fileName": "20250205-nih-153-V1_TRX",
    "date": "2025-02-05",
    "series": "NIH",
    "episodeNumber": "153",
    "episodeTitle": "PWCs Next in Health podcast",
    "hosts": [
      "Glenn Huntzinger",
      "Jenny Colapietro"
    ],
    "guests": [
      "Thom Bales",
      "Alena Taylor",
      "Ruchita Kewalramani"
    ],
    "guestWorkExperience": [
      {
        "name": "Thom Bales",
        "title": "Leader of Health Services Advisory Practice",
        "company": "PWC"
      },
      {
        "name": "Alena Taylor",
        "title": "Not specified",
        "company": "Not specified"
      },
      {
        "name": "Ruchita Kewalramani",
        "title": "Not specified",
        "company": "Not specified"
      }
    ],
    "transcript": "\n**Glenn Huntzinger** (Host): [00:00:00] Welcome to the PWCs Next in Health podcast. I'm Glenn Huntzinger, PWCs Health Industry's leader, and I am thrilled to join you as your new co-host of our Next in Health podcast series interviewing guests alongside your longtime host, Jenny Colapietro. I'm excited to be here and looking forward to the topics we have to talk about in 2025, and there's no doubt it'll be an exciting year for health.\n\n**Jenny Colapietro** (Host): We're delighted to have you here, Glenn. I think your perspectives, experience and your personality will bring some new energy to our conversations. I'm Jenny  Colapietro PWCs Consulting commercial leader, and today we're pleased to welcome back Thom Bales, leader of our health services advisory practice.\n\nJoined by Alena Taylor and Ruchita Kewalramani, they're gonna provide some insightful perspectives on what 2025 holds for health services. So team, welcome to the podcast.\n\n**Thom Bales** (Guest): Thank you, Jenny, and welcome Glenn. Great to have you in your role and on this podcast.\n\n**Alena Taylor** (Guest): [00:01:00] Happy to be here.\n\n**Ruchita Kewalramani** (Guest): Thank you for having us.\n\n**Glenn Huntzinger** (Host): All right, well, the team is excited to talk about what we think about the health services organizations and what we're gonna see in 2025.\n\nBefore we talk about 2025, probably makes sense to just recap what happened in 2024. There's no doubt there was some challenges along the year for both payers and providers given the increasing public scrutiny. Both from consumers and from the government over affordability, concerns and barriers to care.\n\nThere's no doubt, access, affordability, and quality are consistent themes. We've heard it day in and day out and we'll continue to hear it. But Thom, before we kind of jump into the year ahead, maybe we can kind of recap what we saw in 24 and use that as a jump off point to what we're think we're gonna see in 25.\n\n**Thom Bales** (Guest): Thanks Glenn. And you know, I was with a client yesterday that we were going through this, and as we talked about 2024, you know, she looked at me and she said, wow, it really was a year that hit harder across the board than what we were thinking. And what was that that hit [00:02:00] harder? Well, first of all, in January, AI went mainstream.\n\nWe had the democratization of it right, where we could actually get on our keyboards and test it and play with it. And we saw how fast and the possibilities with it. In February, we ran into an unprecedented cyber breach in the us, impacting all of us. We saw into the spring and over the summer the intensification of the scrutiny of the role of PBMs related to drug pricing transparency.\n\nWe saw deal scrutinized the ongoing clinical labor shortages persisting the third year in a row of rising medical costs. It's the first time in almost 15 years that we've had three years in a row of rising medical costs. We saw the reality of consumer activism at its worst at the end of the year. And then as we exited the year with the new administration's healthcare agenda, we saw uncertainty and questions on many fronts around how is it that we thought about healthcare policy in the US regulation and where we were headed.\n\nSo we enter into 2025 in a year with this uncertainty [00:03:00] and a year with the potential for mounting stakeholder frustration. A different kind of government scrutiny and activism that could couple with consumer activism to make it a very interesting year. Health plans and health systems are going to need to be ready to respond with broader resilience strategies and along the way just playing greater vigilance.\n\n**Jenny Colapietro** (Host): Yeah, Thom 2024 was definitely a challenging year to say the least. And as you outlined, 2025 has its uncertainties and challenges, particularly with the new healthcare administration's healthcare agenda and the questions that remain. Thom, what should payers and providers be focused on in 2025, and what should they keep their eye on?\n\n**Thom Bales** (Guest): In our report, we outlined 10 sector dynamics that leaders need to watch and act on, including the ongoing need to control costs, make healthcare more affordable, and then to remain on alert as they face increasing cyber attacks. And for many of you who are out there [00:04:00] and leaders in your organization, you know that these are coming in daily and at times they can be quite egregious.\n\nLet's just focus on a few of the other issues starting with the news out of Washington. PWC has our own health policy desk where we are staying alert daily on the major policy changes that are coming out from President Trump's administration. Changes that are related to tax, potentially impacting our academic medical centers, changes that are related to reimbursements.\n\nImpacting both health systems and payers, and then how we think about Medicare and Medicaid, which we'll get into in a little bit more here. And for those listening, we encourage you to check out our latest updates on the administration. They're available on our website, and we'll also be doing deep dives through this podcast.\n\nBut I would also say it's a time period to get more active. And I know that in the past couple of weeks, as I've spoken to many of our clients, leaders. They're spending more time in Washington just trying to educate and make sure that under the framework that is being developed now [00:05:00] around healthcare, that the new administration understands the implications and the impacts for that, and that likewise, our health plans and health systems are in a position to be ready to respond to those as they come through being at the table, staying informed and ready to pivot as needed.\n\nSo back home within your own organization, that means the ability to have scenario planning, actively talking through what those scenarios might look like, thinking through how the profit pools might shift and where resilience in those profit pools and revenue could be as they start to face policy headwinds.\n\nAnd for some of our organizations, it's even exploring new business relationships for different kinds of growth. We've seen that in the last five to 10 years. What does it mean to be a consumer healthcare organization? What does it mean to be an at scale industrial strength health system? There's going to need to be more explanation of that in 2025.\n\nAnd then lastly, underneath all of this, we have the incredible opportunity and innovation [00:06:00] that comes with AI that sits on a requirement for everybody engaged to do more around data risk protection and cybersecurity management overall as they adopt ai. So now let's do a quick deep dive on one of the most important segments in US healthcare, and that is our government programs, Medicare and Medicaid funding.\n\nAnd to that, I'd ask Ruchita to walk us through that.\n\n**Ruchita Kewalramani** (Guest): Glad to be here and to talk about government programs as one of the biggest growth vectors that we see in the industry right now, both for payers and providers, but also our formal life sciences clients, where this segment government programs is going to continue to grow at a faster pace than any other population in the industry.\n\nWhen we think about government programs, we really anchor on two big areas. The first one being Medicare, where . There are nearly 70 million Americans that are covered by Medicare today [00:07:00] and 90 million that are on Medicaid. Including the Children's Health Insurance Program, which is called as Chip from Medicare.\n\nWe see the new administration pledge to protect Medicare in principle. However, if you think about the landscape and listen closely to some of the earning calls, both from our peers and provider clients, there is a lot of undercurrent and continued questions about the reimbursement landscape. Medicare, the increased utilization that we still continue to see, both from disease prevalence, but also disease acuity in Medicare, and then also the competitive landscape in Medicare, in which the top five plans get about three fourths of the share of the market every year.\n\nSo there are a lot of questions out there in how . Plans and providers should play both from an offensive as well as defensive strategy in Medicare on the offensive. [00:08:00] Medicare has become a game of good product, good marketing and provider education to drive. The right documentation and invest in table stakes, but also on the defensive.\n\nThere is a lot of opportunity to guide member education, drive behavior, change, and manage the total cost of care of the programs that the payers and providers have. What . We continue to observe in the market is the question in Medicare, if there will be exits in the market. So we do anticipate some m and a activity in the Medicare market for plans and providers who do not have the right level of profitability due to the scale.\n\nSo if you think about Medicare Advantage, you know, three fourths of the market is with the top five players, but then there is a very long tail from there on, and those are . Provider sponsored health plans, but also regional health plans that do not have the scale and are asking the question can they remain [00:09:00] in Medicare?\n\nIn that we are starting to see certain exits, but also collaboration in the market. So we do anticipate more m and a in the future on Medicare. And then there will be more deals from a capabilities build perspective as well, both from investing and acquiring the right platforms, the right data strategies, as well as use of ai.\n\nYou know, in the last two days I've spent time at a client where we've been spending a lot of time on their platform strategy to manage the Medicare population with the right set of data, the use of AI to drive more efficiency and effectiveness in their clinical operations group. So I think those trends will continue in 2025 onward.\n\nShifting gears to Medicaid. The decision on Medicaid and the populations and number of enrollees might shrink as we think about where this administration is headed. But how much does it shrink by? Vary [00:10:00] state by state. So in Medicaid, it is much more around the landscape that favors more deals in consolidation towards larger plans.\n\nAnd then where the market shrinks, it will be more of how the market distributes between the players that remain. That's what we observe in the Medicare Medicaid landscape, and that's what we anticipate.\n\n**Glenn Huntzinger** (Host): Thanks, Ruchita. The comments you made no doubt were similar to what we heard a couple weeks ago at the JP Morgan Healthcare Conference.\n\nThat's always a good time to kind of kick off the year and set the path for the year ahead. I think the constant comments around just having certainty, from a governmental perspective, the thought about capital being available and certainly the need for people to transform and growth resonated. I think the key thing that we continue to hear is bending the cost curve and how do we accelerate that bending and move it up?\n\nThere's no doubt that sort of consolidation and scale [00:11:00] will be one of the levers and probably something we'll see in the near term. And then, you know what resonated ? Time and time again was around technology and there was one consistent belief and method here in that technology is gonna be the thing that can help bend the curve and the solution longer term here.\n\nAnd so, Thom, as you think about that disruption, maybe we can talk a little about, you know, what you think given the landscape and how excited you are for the year ahead, particularly around some of the AI that we've heard.\n\n**Thom Bales** (Guest): Thanks, Glenn, with the generally pro business stance expected from the Trump administration and the easing of regulatory actions to accelerate AI adoption, we definitely see the stage set for companies to make deals, to gain capabilities and in particular to partner and or build their AI and tech enabled capabilities.\n\nAnd I think something to think about that at the time it made a headline, but there was so much that was going on. I'm not sure the people registered it. Is back in late fall and the winter, we had one of the largest releases [00:12:00] of personal health information in US History, and it was completely at will done at the ask of one of our significant figures in the government these days and in the tech industry.\n\nAnd it was a massive release of images, of records to build and fuel an AI powered health navigator. Now, take that for what it is. It's interesting, you know, around what that enables around ai. I think it also potentially raises questions on how is it and what do we think about the willingness of individuals to manage their PHI differently?\n\nIt will be a gray area for a long time to come. There will remain a significant securities related to it. It's also interesting to start to think about if we start to move towards an opt-in of sharing of that information more broadly, does that even accelerate AI more for those organizations, our payers and our providers that are participating in this accelerating AI [00:13:00] adoption really comes down to its strong data foundations.\n\nIt's managing the risk associated with that data. It's getting to a value-driven strategy on where you apply and how you invest. Also, and we're seeing this and we're having a lot of discussions on this, the workforce readiness and what does that mean in terms of the day-to-day job? How are they embracing it?\n\nWe ourselves, we're embedding AI prompt engineers, developers with teams to help the teams think through how they do their work differently and drive value. Then as we have discussions with our clients, it is interesting. There's patterns emerging around how our clients are using ai, and it's very much around where their strategic capabilities are, is where we're hearing the greatest successes.\n\nSo for example, one of the largest US health systems have massive workforce management and scheduling challenges, and AI has been applied there with success, driving value, and optimizing staffing and productivity. Another [00:14:00] example. We see one of the health plans using AI to really get in front of care management, behavioral engagement and targeted interventions to manage the cost of care and really to also enable just a better experience for their members, our consumers.\n\nAnd then lastly, across the board, a general upskilling and awareness for the employees of all of these organizations. At JP Morgan, we heard the AI message loud and clear. It probably every other talk brought it up in some context. And everybody is buzzing about the advent of autonomous AI agents that will be able to execute work, perform workflows, mimic what we do, and get in front of some of the problems that we have today.\n\nAnd I think that across this, it isn't just about productivity, it isn't just about getting to a sort of a moment of delight for something that's unexpected. I think that folks are thinking about that this is an opportunity to really change how healthcare is delivered, and as the US economy [00:15:00] approaches 20% of our GDP in healthcare, can AI deliver higher quality, more timely, with better affordability in a way that actually moves the needle on that 20% that we're all hopeful for?\n\nWe look forward to partnering with many of our clients on this, and we'll see what the future holds.\n\n**Jenny Colapietro** (Host): Yes, Thom, absolutely. Certainly excited to see how healthcare organizations further embrace and incorporate AI and agentic ai. It's very exciting. Another key theme that persisted at JPM is affordability and the continued focus on care that's affordable and convenient, and hence consumerism.\n\nAlena, how are you seeing the industry respond so far relative to consumerism?\n\n**Alena Taylor** (Guest): One of the big trends that we're seeing in this space is the growth in care at home. It's a $150 billion market today, and it's continuing to grow as more services are emerging. It's really closing that [00:16:00] gap between what is that more traditional home health that's been in the market forever, and then the acute care hospital at home that's really been rising over the last several years.\n\nAnd while the interest in investment in this space is significant across payers, providers, as well as new entrants, it's still a relatively nascent market and a lot of providers are working to figure out how to make care at home financially and operationally sustainable so that they can meet those patient.\n\nRequest to have that convenience in their care, and I'd really categorize those providers into a few, not entirely mutually exclusive categories. There's those that are using care at home because they're capacity constrained, and the home setting creates a less capital intensive method to create new capacity.\n\nThere's also those integrated delivery networks that are looking to create a lower cost care setting. And lastly, there's those care model innovators that are looking to shift [00:17:00] care to the home and close their brick and mortar capacity, and really have the operational discipline to make sure that they are closing that brick and mortar capacity as the care moves.\n\nAcross all of these categories, providers are continuing to work on how to reduce the cost of providing care in the home to meet that affordability need that you mentioned, Jenny, and one of the biggest levers that they're using here is as they're building more infrastructure internally, they're starting to in-source supply and labor needs so that they can take advantage of their internal contracts and create long-term sustainable programs.\n\nOn the flip side, a lot of the vendors in the care at home space, many of whom have been acquired by large payers and new entrants, are continuing to evaluate how they balance between being a technology or a service provider, and what will really allow them to create differentiation and ultimately scale in the market.\n\nNeedless to say. I'd expect we'll continue to see a lot of activity in care at home. As you [00:18:00] mentioned, patients are looking for convenience. They prefer being at home over hospitalization, and CMS continues to report positive results with lower readmissions and mortality rates when care's received in the home.\n\n**Thom Bales** (Guest): I love that Alena, and in addition to home health as a consumer bend, you know, there's an interesting development and growth that's going on in new kinds of coverage products that some people have heard of. I think a lot of folks are still learning about it, but level funded plans are gaining traction and smaller group employers where the risk is split differently and more consumer say, is given to the employees on how they direct their own spend and their own choices.\n\nAnd through individual coverage, health reimbursement accounts. . Which is an alternative to traditional group health plans, and in essence allows the employee and their family to choose which plan they get out on the open market. And these plans have grown by 30% in the last several years. And with [00:19:00] icra, which is the acronym for individual coverage, health reimbursement accounts, they call it icra Employers, provide these defined non-taxed reimbursements to employees.\n\nFor qualified medical expenses, which are most medical expenses, and the consumer is free then to purchase this coverage in the individual health insurance marketplace. It's a different kind of consumer empowerment, possibly a different response to this consumer activism. And I think the most interesting thing is because of how it's targeted, the use of the marketplace, how the consumer starts to sit in the middle of it, it is an opportunity for some disruption.\n\nAmong legacy health plans and even with Payviders as it continues to grow, and they start to look at how is it they might penetrate different regional markets in a way that has been more challenging for them, going up against some of the larger consultant groups that administer benefits. So I think it'll be something not just to keep an eye on, but actually to get [00:20:00] in front of and as most organizations, to have a strategy.\n\nA, how do you provide the coverage? B, how do you actually manage that population? And then on the provider side, how is it they respond to those folks that are in that coverage and ensure that how you've coordinated your contracts, developed your networks to support these products are creating the kind of loyalty that you're looking for as a health system through this.\n\n**Glenn Huntzinger** (Host): Thanks, Thom. I think that's a great segue as we think about . Kind of the health systems and the payers and what they're doing to sort of bend that cost curve and obviously create value for all the different stakeholders that are out there, patients and otherwise, you know, in recent years, you know, we've kind of seen more of a treatment of acute diseases and I think the question is as we move forward in the next 1, 5, 10 years.\n\nWhat are we gonna see and how do we see health playing out? So maybe we talk a little bit about that and then that could hopefully dovetail into how companies think [00:21:00] strategically a little bit, sort of medium and longer term.\n\n**Thom Bales** (Guest): Thanks, Glenn. It's a great question and we host a chief strategy officer forum for our health systems that we work with, and it's a great dialogue.\n\nThey do most of the talking, and one of the things that was really top of mind for them is where to place their bets in their investments and how to think about that, and a time when the macro trends and sector dynamics are redefining value. Should they be investing in these large next generation EHRs?\n\nShould they be investing into next generation ERPs? How do they think about consumer engagement? How do they think about developing their own products? And on the payer side, it's the same kinds of questions with a shift out of the back office into the front and the middle office and how to define those investments.\n\nAnd the reality is, is that if you're in healthcare today, . The current business models carry very significant large investment in operating costs and also come with environmental impacts that are leaving certain communities and patients behind. So as an organization [00:22:00] as PWC, we've started to think about how is it you bucket these questions, these strategic choices, and the models that might be retired and those that could be replaced with something new.\n\nAnd how do you think about what that value is? And so we've created our own four Ps around. How do you think about what that value is? And just to get into this, we're doing this in the US but we're also picking this up globally, and that value revolves around these four things. The first prevention with more focus on addressing the risk factors of health decline.\n\nThere's vast opportunities for payers, providers, employers, and globally governments to engage with consumers on targeted health education and outreach to members patients. Encouraging and incentivizing them to seek preventative care. We have not finished the story on behavioral economics and there will be a lot that comes there related to engagement and tailing Off of that, we've got personalization.\n\nOur second P personalization, data driven. Customized treatments based [00:23:00] on factors like genetics and behavior, and at times in concert, in an ecosystem with payers, providers, pharma, life sciences, really thinking about what an individual's need is. Coming up with solutions that lead to personalized care. In a world where we have more data, we have the ability to exercise that data, and we have the ability to engage with our members, patients, consumers in more ways than ever before, and we have an increasing battle for attention for those same individuals Getting this right, understanding personalization will drive value for the individual and it will drive value for the organizations that invest in it.\n\nThe third P prediction. With the active analysis of wellbeing and early intervention to improve health outcomes, we can do more today. Clinicians can intervene before medical crises occur. By using predictive models that analyze patient data and activities, they alert them to engagement, to intervention.\n\nThey offer prescriptions, prescribing [00:24:00] what actions they should be taking, and AI is helping this now, and I think that in the next 12 to 24 months, we're gonna see a massive, massive acceleration of the engagement in AI and the delivery, the decision making that is associated with clinical care. And then lastly, our fourth P as Alena referenced earlier, point of care.\n\nWith more accessible and convenient settings for delivery of care. There will be more options that are available for consumers. They will fit the other three Ps, prevention, personalization, and prediction, and will be formed around that, and there will be a migration to lower cost and greater convenience.\n\nThat's already underway now, but with the technology that we have at hand and the ability for companies to be more transparent, to offer up more convenience. To really engage virtually, there will be the option to deliver the kind of experience that suits consumers, busy lives and their comfort levels mixed with [00:25:00] still the hands-on human nature of what care is and the right balance of that, that we know that they expect at times.\n\nAnd they continue to tell us this in our surveys, but in ways that meet them where they are, including home health. And for us in the us. Really meeting the needs of where some of our most expensive patients are in our aging population, and that is with our seniors as well. So we look forward to this. So the four Ps prevention, personalization, prediction, and point of care we believe can set the tone for where value goes in the next 10 years.\n\n**Glenn Huntzinger** (Host): Thom, Alena and Ruchita. Very insightful thoughts on our sector and the priorities for 2025 and how we can all prepare for the future shifts in the market. I mean, there's no doubt the continued focus on access, affordability, and quality is here, and there's a clear lens around bending the cost curve, and tech is gonna enable us to really drive and turn the corner in the most efficient manner.\n\nYou know the biggest takeaway I have here is [00:26:00] there's no doubt, the planning for the future and keeping an eye on what could be a very inable sort of ground game here with possible stroke of the pen effect of impacting our health and the payers and providers from a reimbursement and otherwise. But the one thing that within their control is just to continue to execute flawlessly to sort of maximize the current business they have as far as to patients and otherwise.\n\nAnd that seems to be something within their control, and I know everybody's sort of focused on that. So no doubt there's a dynamic out there of continue to focus on the ground game while looking ahead and keeping your eyes and ears open for. How the landscape may change. So it'll definitely be an interesting year for 2025.\n\nI look forward to seeing how things continue to evolve. Jenny, any thoughts from you here?\n\n**Jenny Colapietro** (Host): Yeah, no, I think this has been great and I really enjoyed reading both about the 10 predictions for 2025 [00:27:00] and hearing more from our team here. You know, I think Glenn, the one that really resonated with me the most. Is this accelerated adoption of ai, you know, and I'm looking forward to see how we apply AI to address the affordability and convenience, to further enhance the workforce productivity, to derive deeper consumer insights, enhance consumer healthcare navigation, and just general application across finance, customer clinical, and core admin functions.\n\nSo certainly excited to see more.\n\n**Glenn Huntzinger** (Host): And as we sort of bring this session to a close, I'm gonna ask Alena and Ruchita to just talk about how they think about resilience and reinvention as we set the path forward for 2025.\n\n**Alena Taylor** (Guest): Yeah, thanks Glenn. First off, I'd say it's definitely not gonna be an easy year. Well, 2024 was a tough one.\n\n2025 certainly has a lot. That's coming our way as well. And from a resilience perspective, it's all [00:28:00] about really watching and acting quickly on the different sector dynamics that we've outlined between the regulatory uncertainty, reimbursement pressures, rapid technology adoption. The consumer demands and the never ending cost pressures, healthcare organizations will certainly have their work cut out for them as we go through the next year.\n\n**Ruchita Kewalramani** (Guest): When I think about Alena and I, we always play the yin and yang in terms of the two sectors of the market that we focus on, and to the resiliency point that she made. I will make the point on reinvention. Where I really think that leaders in the industry have their sites set on how can they differentiate in a market that is very competitive.\n\nAnd so we will see a lot of business model reinvention in the next two to five to 10 years, payers and providers coming together and exploring new payment models [00:29:00] to drive value to their consumers. New capability models and really payers and providers taking what they do really well and putting it out in the market to commercialize on those capabilities.\n\nIt's ideas like these that will create new avenues for growth as well as profitability improvement for all sides of the market. And so I feel really optimistic about reinvention and the idea of new business models that I think that will continue to flourish. In the healthcare industry over the next five years.\n\n**Jenny Colapietro** (Host): And there you have it. 2025, the year of resilience and reinvention. Thom, Alena, Ruchita, thank you very much for joining us today and sharing your perspectives.\n\n**Thom Bales** (Guest): Jenny and Glenn, thank you for having us.\n\n**Alena Taylor** (Guest): Thanks so much.\n\n**Ruchita Kewalramani** (Guest): Thank you.\n\n**Jenny Colapietro** (Host): And we invite our listeners to read the 2025 next in Health Services report, linked in the show notes and to follow us on social media. You can also [00:30:00] find the latest updates from our health policy desk, as Thom alluded to earlier.\n\nFor more on these topics and other health industry insights driven by policy, innovation and care delivery changes, please subscribe to our podcast at pwc.com/us/next in Health podcast. Until next time, this has been next in health.\n\n**VO**: This podcast is brought to you by PWC, all Rights Reserved. PWC refers to the US member firm, or one of its subsidiaries or affiliates, and may sometimes refer to the PWC network. Each member firm is a separate legal entity. Please see www dot PwC dot com slash structure for further details. This podcast is for general information purposes only and should not be used as a substitute for consultation with professional advisors.\n\n",
    "audioLink": "",
    "wordCount": 5274,
    "extractedAt": "2025-10-28T05:15:29.755685",
    "keyTopics": [
      "Leadership",
      "Technology",
      "Healthcare",
      "Business Strategy",
      "Procurement",
      "Career Development"
    ],
    "notableQuotes": [],
    "summary": "In this episode of PWCs Next in Health podcast, host(s) Glenn Huntzinger, Jenny Colapietro interview Thom Bales, Alena Taylor, Ruchita Kewalramani key topics including Leadership, Technology, Healthcare. The conversation covers insights from experience at PWC, Not specified."
  },
  {
    "id": "22_0322_Present_010-V1",
    "fileName": "22_0322_Present_010-V1",
    "date": "2022-03-22",
    "series": "Present",
    "episodeNumber": "010",
    "episodeTitle": "Present Navigating and Enduring Life Events",
    "hosts": [
      "Mark Wilmont"
    ],
    "guests": [
      "Syed Jaffrey",
      "Emily Molina",
      "Jennifer Barish"
    ],
    "guestWorkExperience": [
      {
        "name": "Syed Jaffrey",
        "title": "Associate",
        "company": "PwC"
      },
      {
        "name": "Emily Molina",
        "title": "Senior Manager",
        "company": "PwC"
      },
      {
        "name": "Jennifer Barish",
        "title": "Human Capital Professional",
        "company": "PwC"
      }
    ],
    "transcript": "\n\n**Mark W**: Hi everyone. My name is Mark Wilmont, and welcome back to another episode of Present Navigating and Enduring Life Events. Today we have a panel discussion that's gonna focus on the leave of absence process, including a few fellow PwCs that have had their own experiences. Specifically, we'll talk with Syed Jaffrey about a cancer diagnosis that forever changed his life.\n\nWe'll discuss how Syed managed his life event, including taking a medical leap from. The difficult road of chemotherapy and the process of coming back to work after treatment. We'll also talk to Emily Molina, who was diagnosed with a rare disease in 2019 and learned to navigate the firm's medical leave options to seek treatment.\n\nWe'll discuss the steps she took to get a medical leave approved. How intermittent leaves are critical for people with chronic illnesses and the challenges of returning to work and managing a chronic illness in the work. Lastly, we'll visit with Jen Barish. We'll return her from a five year leave of absence in 2015, Jen was diagnosed with acute myeloid leukemia, a [00:01:00] fast moving blood cancer in December of 2010, and received a lifesaving bone marrow transplant from an anonymous donor In February of 2011, we'll talk to her about how she leveraged berm, provided resources to assist with her return to work, and continues to proactively manage her work environment needs.\n\nSo with that, let me start by welcoming our guest to the episode.\n\n**Jennifer Barish** (Guest): Thanks so much for having us, Mark.\n\n**Syed Jaffery**: Thank you, Mark.\n\n**Emily Molina** (Guest): Thanks, Mark.\n\n**Mark W**: All right, so diving right in guys. Let's do a quick introduction. I know I went over at the top of the episode here a little bit about each of you, but I'd like to maybe let each of you introduce yourselves with who you are, your role at the firm, and then talk a little bit more about your life event in detail.\n\nSo Syed, if I kick it to you, can you go ahead and start?\n\n**Syed Jaffery**: Yes. Thank you, Mark. Hi, my name is Syed Jaffrey. I'm an associate at the firm in the transformation. The summary of my life event was I got diagnosed with cancer in January of 2022, only six months after I started working at the firm. And a little bit summary [00:02:00] after that was I had to have surgery, I had to go on chemotherapy, I had to have a leave of absence.\n\nI had to then extend that leave of absence after it was noted after the surgery that it would require even more treatment, and I had to kind of figure out how to go on a leave of absence and how to balance these things. When you just started a role at a company.\n\n**Mark W**: Great. Thanks. I good to have you here and interested to hear about how you managed things being so new to the firm, and I think a lot of us have the luxury of being at the firm for many years and knowing our coworkers really well, and you had to kind of deal with a leave of absence right after you started.\n\nSo next, Emily, do you mind talking a little bit about your background?\n\n**Emily Molina** (Guest): Sure. Hi Mark. I am a senior manager within our cloud and digital practice, and I've been with PwC almost seven years now, serving our clients in the entertainment and media industry. When I was a senior associate back in 2019, I was diagnosed with a rare autoimmune autoinflammatory disease called Behcet's disease.\n\n[00:03:00] And the disease really affects the blood vessels in your body, and so most of the symptoms and side effects of having this disease can seem unrelated or disparate for a very long time. Most people get diagnosed much later in life, so I consider myself lucky for getting diagnosed in my twenties, but my story really focuses around.\n\nDealing with a chronic illness, taking leaves when I need to, before it escalates to something more serious, and really advocating for myself and asking others to help me advocate for myself when I can't do that on my own.\n\n**Mark W**: Great to have you here, Emily. Really glad to hear your perspective on the intermittent leave of absence process.\n\nYou know, I know myself and Syed can add a discreet one leave of absence back, hopefully for good, but with your chronic illness, it's something that you have to battle with constantly. So we'll be great to hear your perspective. And then last but not least, Jen, would you mind introducing yourself real quick?\n\n**Jennifer Barish** (Guest): Hi Mark [00:04:00] and team. Thanks for having me here today. It's a privilege to share my story. I am with the firm 26 years and ticking. I started out in client service and have had, uh, a long journey in human capital since around the year 2000. So I've been around a while, worn many hats, and the firm has supported me along the entire way.\n\nI am 13 years post-transplant. It was my cure to rid of leukemia, which is a blood cancer. And what I thought was, oh, I'll deal with this. I didn't even know what a blood cancer was. I'll be back to work in no time. Turned out to be a five and a half year leave of absence. So lots of journey pillars, milestones along the way.\n\nBut the firm was by my side every step, sometimes helping me to navigate, sometimes me needing to be a proactive person on my own navigating. So I'm thankful to share this story with all of you today, [00:05:00] and tools and tips on how I stay present and in the moment and continue to have a great career here at the firm.\n\n**Mark W**: Yeah. I really appreciate having you here, Jen, and sharing your story, especially since your leave of absence was extended and it's been a little bit since you were on a league, just seeing how you've been able to thrive since being back. Not to mention the fact that you're at human capital will provide unique perspective as well, so, I wanted to start the episode after those introductions with talking a little bit about how do you know that it's time for a leave of absence?\n\nI know for me personally, I got diagnosed with my cancer and it was really sort of a no-brainer. It was you're gonna start chemo and radiation right away. You can try and work through it if you want. It's a personal decision. I know some people do work through treatment. I chose for me to take a step back, focus on myself, and come back better and focused on being able to serve clients.\n\nSo Syed, can you talk a little bit about your diagnosis and then how you decided that ALE was right for you?\n\n**Syed Jaffery**: Basically with [00:06:00] my diagnosis, it was kind of very sporadic and then all at once, so I knew something felt often wrong with me and I was kind letting my manager in the know saying, Hey, I feel a little weird.\n\nI'm going to doctor appointments. Don't really know what it is, but there's something kind of off. And my manager was completely, you know, supportive and kept telling me, Hey. Don't try to keep going at the evenings. If there's someone just go during the day, we can cover for you. Just keep us in the loop and you know, hope for the best and share as much details as you want.\n\nYou know, we're here for you. So I did really enjoy my major supporting and eventually what happened is one of the times when I went to a doctor, they were able to find a little bit of outgrown mass and that kind of sparked everything where they kind of told me, Hey, take the rest of your day off and go get a bunch of tests at the hospital.\n\nSo I went to the hospital, got a bunch of. And within the next 48 hours I had a bunch of, we're not saying it's cancer, but even if it's not, this is pretty dangerous, we need to remove this immediately and then after we can kind of assess what to do from there. So in [00:07:00] my thought, I thought I would be taking a quick couple days off sick days, get surgery, kind of go from there.\n\nAnd when I was informed that it would be more of a major surgery and I would need about minimum of 14 days before even attempting to my L who I was also contacting about this, told me let's do short-term disability. Phil went to, uh, PwC Reed Group and emailed them. They kind of walked me through how to do this cuz I was so new to the firm.\n\nI didn't even know short-term disability was a thing until I talked to my RL and I submitted my 14 day request saying I'll be back in two weeks after my surgery. After my surgery, they were able to kind of take the tumor and do some tests with it and also kind of do another testing while looking around.\n\nAnd it was figured that not only was a cancer, it was much worse than they thought. So then it was perceived that I would've to do chemotherapy. And not only that, it would be chemotherapy, but it would be for much longer. And they recommended me not to work through it at all just because of the intensity and how many hours I'd be doing it and how many cycles.\n\nSo I had to kind of find a way to [00:08:00] then extend my.\n\n**Mark W**: So how did those discussions go? So you're on short-term leave. Doctors recommend taking a longer leave of absence. Did you work through the Reed group or did you talk to your L or both? Or how did that process go?\n\n**Syed Jaffery**: Yes. I originally reached out to my RL apologizing.\n\nI was saying, Hey, I know I said two weeks, but it looks like it's about to be not indefinite amount of time, but a very long time. Do you know who a contact? Is it regroup? Is it you? I'm very lost here. And they were able to be like, first of all, relax. Second of all, health is a priority. We're not going anywhere.\n\nThird of all, I will tell your talent consultant. You can also email, regroup, and tell me an extension and basically fill out that same form you did the first time. But just kind of make a little note saying, I need an extension on that previous leave.\n\n**Mark W**: That's helpful. I think one big part of your story, Syed, that resonated with me is you, you said you kind of thought this would be a short-term, 14 day thing and you'd be in and out and back to work.\n\nAnd I didn't have that personal experience, but the 14 days, but I thought I was gonna be in and [00:09:00] out and back to where I was and it's a much longer process to get back up to speed as you go. So, Side note that really resonated with me. But Emily, curious about your perspective, especially with the chronic nature of your illness and the fact that it comes and goes.\n\nHow did you decide the first time that a leave of absence was right for you? And then how do you continue to analyze that and determine when you need to take a step away?\n\n**Emily Molina** (Guest): Yeah, it's a little different with chronic illnesses, I will say you tend to get used to recognizing the warning signs over time of when something.\n\nCould be flaring up, but the first leave was a little different for me because I didn't know what the warning signs were. I was just starting to understand what my diagnosis meant for me. So I was diagnosed in December, 2019 and immediately started treatment. And when you have an autoimmune disease, you typically have to try a few medications or [00:10:00] treatment options before one sticks.\n\nSo I started medication. I think the firm shut down over the holidays, helped me take some time away, but when I came back to work in January, I started to realize that this was going to be a lot more difficult to manage. I hadn't told my team what I was going through, and so I was also trying to get promoted that year, and I was just really worried that my health issues would slow me down or get in the.\n\nAt the same time, I didn't really know what my diagnosis meant, so I didn't know if this was going to be life. I didn't know if this was just a hiccup for the year, so I was trying to keep everything private so that I could just focus on work and get promoted later in the year. But unfortunately, one of the first treatment options that I did try had some really serious side effects, and I was dealing with some adverse reactions while I was on.\n\nDuring a work day, [00:11:00] and I would try and hide it from my team. So if I was dealing with pain or I'd get really dizzy, sometimes I'd go into a private office and just wait for it to pass. But one time it just got really bad and I passed out in that office. I don't know how long I was out. It could have been a couple minutes.\n\nIt could have been an hour. But eventually I came to, and I called my mom who was on the east coast. I was on the west coast, so I'm not really sure where I was going with that. But she told me to hang up immediately and go seek help from my team. So that's what I did. I kind of crawl, walked across the hallway to my manager at the.\n\nI was really embarrassed cuz I had all these clients looking at me and I was clearly in distress. But eventually my manager and a group of my clients actually drove me to the hospital, stayed with me until I kind of stabilized and it was. After that experience where I sat down with my [00:12:00] manager and my partner and told them what I was going through, they suggested I talked to HR about a medical leave, which I didn't even know at the time was an option for me.\n\nSo it was definitely a slower start. But now today, if I recognize those warning signs, they're different every single time, but there is some consistency in, in my case, it's inflammation. So if I notice inflammation, even if it's the smallest symptom in my vision, or am I hearing, it might not seem like something that warrants a medical leave, but it helps me understand what's coming and I can kind of be more proactive about it instead.\n\nThe situation I had the first time, which was, in my opinion, very reactive.\n\n**Mark W**: Wow. I've heard your story many times and I've not heard that part of it. I know each time you share a little bit more, but that was really powerful, so thanks for sharing that part of it. Knowing what you know now about the leave absence process, would you have done anything differently?\n\nLike would you have gone to your [00:13:00] RL or your team manager earlier to the share information or would you have stated the course that you went.\n\n**Emily Molina** (Guest): Yes. In hindsight, I would have gone to my RL, even my manager, my coach at the time, just to let them know what I was going through. I think part of the stress that really exacerbated my situation early on was the fear that I could lose my job, or the fear that I would be perceived as somebody who wasn't productive or wasn't fit for consult.\n\nAnd knowing that I had an option to take a medical leave and continue getting paid and being employed while seeking treatment and managing my life outside of work, I think that would have removed a lot of the pressure and the fear of exposing this to my team and things never being the same. I think if I knew about the medical leave, Earlier, I could have prevented a lot of this.\n\nI don't regret anything, but this is why I tell my story publicly today. [00:14:00] It's if anybody out there is dealing with something similar or is experiencing health issues but hasn't gotten a diagnosis and is scared about what it could mean for their careers, I think it's just amazing that the firm will stand behind you even in those times of uncertainty to make sure that you are your best self and healthy at work.\n\n**Mark W**: Yeah, I think awareness is key about the leave of absence process. It's one of those things people don't usually think about until they need it, and by then it can be a little too late. But Syed, I know you had similar feelings about fear of how is it gonna be looked at if I take a leave and those types of things.\n\nAnd. Being in the life events pillar, I've talked to a lot of people about their different life events and their leaves of absence, and the recurring theme is that the firm has been so supportive. My coaches, my managers, my rls have always said, you know, you gotta take care of your health first. People come first.\n\nAnd I really think that's the case here with the firm. And it's heartbreaking to hear, Emily, that you had suffered so much trying to keep [00:15:00] up a brave face and worried about promotion when you had something so serious going. But you got to the right spot, and I know you got promoted, so they all ended up working out at the end of the day.\n\nBut sharing your story to raise awareness, I think is very important. Jen, moving on to you. I know your story is also very serious from Aleva absence perspective. Can you talk a little bit about how you knew that you were sick and when you decided to take a leave of absence.\n\n**Jennifer Barish** (Guest): Yes, yes. So how I knew I was sick. I was working full-time.\n\nI had a two and a half year old and a five year and a half year old at home. So I just thought I was tired, mom. Basically, I was on site, I was in human capital at the time, supporting one of my client service teams on site locally, doing an HR visit with them. I went out to the client and I would. If there was critical mass at a client, I would visit with them and I had this strange cut on my hand that was not healing.\n\nIt was around Thanksgiving doing dishes. Scap came off, [00:16:00] scam didn't really form back on. Thought it was weird. Kind of paid attention to it, kind of didn't pay attention to it. I was busy. Well, it happened to be a slower day. Finished the site visit early, and lo and behold, I had no immune system. That's why the cut wouldn't heal.\n\nThe cut wouldn't heal. I was walking around a Michigan winter. If I would've gotten the colder flu, my life literally could have ended. I had no immune system, so the cut on my hand I feel like was a wink to like go get in and get checked out. Sometimes we see signs and signals and we don't wanna overreact, we don't wanna go into the doctor for every little thing that happens to us.\n\nBut when something does feel off, and this did, I went in and from there after some blood tests and whatnot. It did turn out to be a blood cancer that was acute, which means it moves quickly. So at the [00:17:00] time, didn't really know much about blood cancers, didn't know necessarily an oncologist was a cancer doctor, like you just don't know these things because you don't need to.\n\nBut I would say just paying attention to some signals that were happening around me got me into the doctor and actually went in that day. And that night I was in the ER with a little tiny bag because I thought I'd be staying the weekend. I didn't know any better. That was on a Thursday, and as we all know on the line, you remember the day, you remember the dates.\n\nIt was a Thursday, Friday, had some bone marrow testing that came back as leukemia, and then the journey went on from there. But I didn't really have a choice. It. Something that happened pretty much very quickly. And not only was I plucked out of work, I was plucked out of kind of like life and home as well.\n\nAnd that was for [00:18:00] four months consecutively before I went home to my home bubble we'll say.\n\n**Mark W**: So you really had the extreme of thinking this is gonna be a short term thing, maybe a weekend in the hospital, and you ended up being five plus years of a life event that you've dealt. I appreciate you sharing that story.\n\nI had heard you tell it before and it's wild to me how a cut on your hand can be the tip of the iceberg and then you end up with this life journey. So appreciate you guys all sharing that story. Wanna talk a little bit about how you decided to share with your teams what you're going through. And I don't necessarily mean your managers or your relationship leaders.\n\nThey absolutely add a certain amount of information that they need to know. I'm talking a little bit more about your broader network and it's probably gonna be a little bit different for each of you based on how long you've been at the firm. But I know when I went through my legal of absence, it's, Hey, Mark's gonna be out for a little bit.\n\nAnd everyone was curious why that was. So you kind of have a choice of. Keeping it to yourself and [00:19:00] letting people think whatever they wanna think. Or you can be open about it and say, here's what I'm going through. I chose the latter option just to be upfront and say, here's what I'm dealing with. You know?\n\nFeel free to reach out to me if you have any questions. Happy to chat about it. But I'm curious, Syed, Emily, how did you guys decide how much to share and who he told and how did you do it.\n\n**Syed Jaffery**: So I actually chose the former as you chose the leader. As in I kind of hit it from everyone that wasn't my manager, RL talent consultant.\n\nI did let people know there were some medical things going on, so I'd be away for a while, my case and it probably wasn't the best looking back on it, but I just didn't wanna burden anyone cuz I, you know, I think I met some really great people at the firm and I feel like everyone would be like, oh, no side's going through this.\n\nOh, like, you know, is everything. In my mind, I was like, they can't really do anything for me. It's just me and the doctors. Like they can be emotional support, but if anything, they're just gonna feel bad and like, that's not gonna make me feel good. And I just kind of, you know, once I returned from my medical leave, I just kind of added, everyone was like, Hey guys, I'm back.\n\nUh, I'm not [00:20:00] dead yet and this is what I was going through. Which, you know, then I had talked to a lot of people who were like, I had no idea, but I chose the former. And looking back, I think I, you know, maybe not everyone, but a little bit more people I talked to day to day or week to week, Could have been letting the know, but I just kind of told everyone a general medical thing and I'll be back shortly.\n\n**Mark W**: Yeah, I think it's kind of a personal decision, right? And it probably depends a little bit on your life event of how much you wanna share what it is and who you want to tell. I don't think there's a right or wrong answer. I was just curious how you each decided to make that decision and, and how you went about it.\n\nSo, Emily, I know your life event is ongoing. Are you open about it? Do you tell people if they ask or how do you handle it?\n\n**Emily Molina** (Guest): I'm still navigating this part of my chronic illness. I will admit, when I first got diagnosed, it was pretty easy for me to talk about because everybody saw me go to the hospital that day and people were naturally concerned, and I stuck around on that project for a couple [00:21:00] years.\n\nSo I kind of felt like I was in a safe space during the first couple years of dealing with this disease. But today, I find that I tend to keep it to myself unless something is coming up. And I talked about those warning signs earlier. It does feel sometimes silly to tell people that I have an autoimmune disease that can get really serious sometimes.\n\nAnd you know, today I have a headache and I think it might be flaring up. I am very mindful that the things I deal with, especially the early warning signs, just seem. Mild symptoms, things that everybody deals with, but it's kind of related to what Jen was talking about earlier with the cut on her hand. I think that's a really important lesson that we don't talk about enough.\n\nIt's to trust your gut and to really, really understand that you know yourself best. And so something that might seem minor, like a cut on your hand or a blurry vision might not connect with other [00:22:00] people if you tell them you need time. But I've just learned to be honest and advocate for myself, whatever that means.\n\nIf it, if it means telling somebody I'm not feeling well today and I need to sign off, that's one version of me sharing what I'm dealing with with people. If I've been on an engagement team for a few months and I'm feeling really comfortable with the team and we're all having dinner or having a coffee chat or some informal setting, I might bring it up too.\n\nI find. Organic ways to introduce it. As I'm talking about myself, you know, I've built a lot of self-care practices and I'm really passionate about health now, so I'll kind of work that into the conversation and if people ask me what my motivation is for my self-care or my health practices, then I'll go into my diagnosis, but I tend to keep it close and just.\n\nOnce I start seeing those warning signs come up so that it's not an added pressure, if [00:23:00] things do escalate to have to tell everybody all at once, I kind of just build upon it over time.\n\n**Mark W**: That's understandable and I can appreciate that. You know, you don't want to be defined by your life events. And I said earlier that I was very upfront about my diagnosis, which I was, because I was kind of all of a sudden on a leave of absence with no explanation.\n\nSo I wanted to be clear with people I'd worked with for many years, why that was, I don't bring up my diagnosis much anymore unless someone asks or comes up organic. Because I'm not just the guy that had cancer. I do other stuff at the firm and I've got other interests and other things I want to talk about.\n\nSo I think that's important too, that just cuz you're open about it at the beginning doesn't mean it's what you are forever and always. So, Jen, moving on to you real quick. Your leave of absence was, I think we said five years. How did you manage that leave of absence as far as staying connected to people that you were close with, people that were caring about you, curious of how things were going.\n\nI'm just curious how you [00:24:00] managed that for five years.\n\n**Jennifer Barish** (Guest): Yep. No, I think between family, friends and firm, it's just kind of fell into place. Before I get into the management, I do wanna say something about the initial management of going on leave now that being a tenured human capital professional as well as being on leave at one point myself.\n\nI just want everyone to know. To Emily's point, if you need to go, you go and the firm was there, you need to go take care of yourself. If you do absolutely nothing, it's all gonna be fine. Your HR person will call the leave center for you. And everything will always fall into place. So if you do absolutely nothing except drop computer, pencil, paper and go and take care of whatever it is.\n\nAnd for me at the time, I didn't know it was a life threatening scenario, but it was, I didn't wanna know the facts, the percentages. Didn't wanna know any of [00:25:00] that. I've always been like glasses half full. I was gonna do everything from a like a meditation, caring for myself standpoint, including making spreadsheets from my hospital bed of who's gonna provide my family dinner and who's gonna pick up kids.\n\nBut I just wanted to be clear that if you do nothing, the firm will do everything still. So that's the first thing. And then in terms. I'll say the marathon leave versus the sprint or intermittent sprints. There was things along the way that I didn't realize, but in the grand scheme of things, it didn't matter.\n\nOnce you come off of a short-term leave with the firm and you move into a long-term leave, sometimes you get back your computer. That's a long-term asset that the firm owns. And that was one thing that, for whatever reason, and that policy might have changed now, but that was huge for me. I was like, oh my gosh, this diagnosis is real.\n\nI have to give the baby back my computer. So [00:26:00] that's when it kind of like hit me. Although I was focusing on my treatment, which at the time wasn't working and eventually did, because obviously I'm here today, I'm healthy, still battling some chronic conditions that aren't outwardly apparent, but that's when it became real and the firm was there.\n\nMy HR professional. At the time was a close friend, so rather than have the leave of absence center call me, sometimes they would call me and give me an update. Sometimes the update would come directly from her. Sometimes I didn't care about the updates because I was having a bad chemo day. So even if you don't pay attention to the messaging that's coming in, I think the firm is trying to just bring you along on the journey.\n\nAnd if you miss a deadline or you miss paperwork, you need to submit for that quarter. Not every week, but over time you have to submit some documentation. [00:27:00] I would delegate it to my doctors, my nurses, and be like, here's the sticky with the facts. Can you handle? The answer is always, yes. They're very familiar with the process.\n\nSo in terms of the. Marathon and not the sprint. It was me kind of dipping my toe in when I felt well enough to be connected, but then also pulling out and not answering the phone or not returning calls or text messages. And then eventually the work responsibilities around month two and a half three started to disappear entirely because.\n\nThe firm needed to find a long-term replacement for my coverage. So it's a blur. I feel like sometimes I'm telling somebody else's story, but the firm handled everything to allow me to focus on myself and the journey I'll say.\n\n**Mark W**: So you're able to focus on yourself and the journey. And obviously it worked. It was a long journey, but it worked in your here, and we're [00:28:00] grateful for that. When did you start to think, \"I might be able to come back. This is something I, I'm thinking about.\" What was the first step.\n\n**Jennifer Barish** (Guest): So in terms of like permission to come back, that's a very careful process as well, because my doctors didn't want me to go back too soon, and the firm didn't want me back too soon until I was ready.\n\nAnd oh, by the way, I was questioning my purpose in life as. Internally, I was thinking, I'm gonna go save the world from leukemia or hang out my own shingled and be a mentor to other bone marrow transplant patients. So in the background I was thinking that as well. I didn't necessarily signal that to the firm because I had been around for a while and I knew that those fleeting ideas could easily.\n\nI had firm health insurance and I had good coverage, and I made a good salary, and I needed to really think about those things as I emerged [00:29:00] from the fog into, you know, sometimes what is a financial state that you weren't necessarily in previously. Sometimes you might've been, if you have the short term disability coverage, the long term, the firm provides great policies, but in terms of signaling on coming.\n\nI always left that door open because I didn't know. I really didn't know, and as it turned out, and still today, I mentor and coach and volunteer through a nonprofit organization. But I realized that I needed to come back for my own wellbeing. I needed to leave for my own wellbeing, and now I needed to come back for my own wellbeing.\n\nAround the four and a half year mark, I got the itch. It wasn't until five and a half years that the doctors gave me permission because. It is a long journey with rebuilding back up your immune system. I had to go through all new vaccinations and I was like a little baby with brand new immune [00:30:00] system, so I had to enter the world again.\n\nBut the firm was glad to have me back. Saved a spot for me, wasn't the same role I was in previously, but that's okay. I left as a manager. 13 years later post-transplant. I'm still a manager and that's okay because every day I'm challenged here. So in terms of when I knew I was ready, You just like internally, you feel the itch or whatever it is, depending on your situation, you just need to take some time to step back and reflect inwardly and check in with yourself to see what's best for you personally and your family.\n\nAnd I ease my way back in 50%, 60, 70. Now, today I'm at a hundred percent.\n\n**Mark W**: You know, I was out for six months and I like to joke that it's like dog years, like public accounting changes so fast. That one year's really like seven years. So I thought a ton changed when I was out for six months. Just people in new roles and new strategies and new groups and titles, all that stuff.\n\nWhat was it like coming back [00:31:00] after five years? It was like a totally different firm or was a lot of it just kind of the same thing with different people.\n\n**Jennifer Barish** (Guest): It's even the new firm, like I feel like week to week now. So we're always reinventing ourselves. We were in a new building. I had a new office I had never been to.\n\nI was showing up with a mask. I was wearing masks before, pandemic masks. But everybody was welcoming and embracing and knew that I was the fist pump gal or the elbow pump gal. And I wasn't shaking hands and I wasn't giving hugs, and I was still, um, a little bit fragile. So the firm did. But I was also an open-minded person, so I knew that, okay, I am gonna give this a whirl.\n\nAnd we had moved from one email platform to another, and I just had to learn it all and I took it all in. And it was almost like I never left, actually, it was a steep learning curve with some of the technology, but I had already been with this firm [00:32:00] 13 years, so I already had, um, some deep connections and relationships.\n\nAnd some good coaches and mentors to help bring me along. And because I had already been with a friend for that long and in human capital recruiting, I was like a, a name that people locally might have recognized. So when I came back, It was like being lifted up. It was amazing. We're in a world today where we're working virtually.\n\nI support a team who doesn't necessarily sit in my location, so it's different now. I wonder if I came back now what it would be like. It would be. Way different now, maybe even harder. But being back in a person and going into the office and having the local presence, it was different back then. But as long as I was open-minded and had the ability to be agile and I'll say willing, and then, oh, by the way, keep the lives of communication open, which is huge.\n\nThat's like the number one thing on my list, whether it's work, personal or if I'm having a low energy day, which [00:33:00] sometimes I do. I just update my team and I might log on later that evening, and guess what? That's how we work now anyway, leave of absence or not.\n\n**Mark W**: You were ahead of your time.\n\n**Jennifer Barish** (Guest): Exactly.\n\n**Mark W**: It's good to hear that your role is flexible enough and, and a lot of our roles are flexible enough to be able to work around whatever type of situation we have, if it's a personal matter or health matter or childcare or anything.\n\nSyed. I wanna move to you for a second. I know you were out for about six months and as a newer person, you had some anxiety about coming back or fears that you weren't sure how you were gonna be viewed. Can you talk a little bit. Those fears, how you got over them and how your return to work ended up.\n\n**Syed Jaffery**: I was so afraid during my leave of absence, and there's still a little bit of fear here and there, but that's more irrational, but that's just kind of what it is when you kind of go through something.\n\nBut to get a little bit more context, not only was it six months into a new job that this happened, This was six months into a new career, into a new field. I came from a [00:34:00] completely different background. I was a scientist, I was a flavor chemist making flavors of food. I was a microbiologist, like I was completely different.\n\nAnd then I did grad school for business analytics and that's kind of what kinda put me into consulting. So I didn't really have a background. I was very, very, you didn't intern, so it was like when I said I started six months that was started, a completely new six. So I was afraid that not only that when I'm gonna go and see the absence that's gonna look negative upon me and that they'd let me go.\n\nThe second I'd come back. I thought it was potentially over end of my career that I have to go back to my previous job that was fond of. There was all this fear of that. And not only fear of just like getting let go. I was gonna be afraid that I was gonna be left behind because there is such a learning curve for, I think everyone when they joined the firm, but especially the first time that they joined as.\n\nAssociate as well as a new career. So I was learning how to be a consultant. I didn't necessarily know, and you know, the interviewers knew that when they chose me, but they said, you'll learn the skills, you'll kind of build you up. And when that kind [00:35:00] of gets taken away from you, I was, I'm gonna come back.\n\nI didn't know it was gonna be six months cuz they said the chemo was gonna last six months, but then there could have been extra stuff and I was just afraid of. Whenever I come back, I'm gonna be so behind everyone, like they're just gonna naturally weed me out. And there was all this fear as well as maybe not as intense, but it still felt real to me that.\n\nI was more physically deformed after my chemotherapy. I lost all my hair. I lost all my skin and color, and it was not, there's one, there's patches of color on me that, you know, it didn't look right and I was like, am I going to be able to go off camera for these client meetings? And even though we live in a hybrid world, I'm gonna have to be in person for some clients.\n\nAre they gonna be here, Paul, to see me or. Am I not gonna show like a strong facing view of the client? Maybe po. She's not gonna want me to be in person for these once I come back. So there was all these fears that I had and I guess kind of walking through how I got over it is, I think a lot of it had to do with my L at the time as well as the previous manager who's now a director that I [00:36:00] kind of talked to.\n\nCuz he kept emailing me every month and a half, two months not to like burden me. Genuine concern of like how I was doing and just like, it'll be fine. You'll recover, you'll look better. You know, once you kind of get off chemotherapy, it's always a little rough. Now you look like as well as just breathe.\n\nLike we'll figure out and if we realize issue, we'll figure it out. Like that shouldn't be your concern of what's gonna happen six months. Your concern should be, do you feel good today? And you know, what are you gonna do the next couple days? Like you shouldn't look forward to the past couple. And I guess another fear I had was I still do treatments as now, not as frequently, but I'm not necessarily over my cancer.\n\nIt's still there, just it's not as deadly right now because the chemotherapy worked to a certain extent. So I was still afraid of are they gonna see me as someone who's gonna be a burden, who's gonna have to keep taking days off, even if it's not a leisure absence? And I just kind of had to work through.\n\nIf I do well and I keep just open lines of communication to those who need to know, I should be fine.\n\n**Mark W**: And you've since switched [00:37:00] roles a little bit, right? Since you came back into something that fits your skillset and your life right now. Can you talk about that for a second?\n\n**Syed Jaffery**: Totally. I basically, my doctor said, Hey, you're done with chemotherapy. We still have treatments. Let's see it. A couple weeks after they said, you know what? You can start to go back to work if you really feel like it. Maybe in a part-time rule or something like this. And they gave me the clearance. So I sent to regroup, Hey, I'm good to go. I'm cleared for work. And I let them know and I let my l and I let my talent consultant know, Hey, I'm back.\n\nBut I had something where, The doctor Julie called it, and some patients I met on the floor called it, but I don't know if it's necessarily a permanent term, but chemo brain where your brain's just kind of shaken up with all the chemicals and treatment you have, so you're not as fast thinking as before.\n\nThings take a little bit more time. So I felt like I had chemo brain and I kind of told them in reiterated. The next project I'm on, could it be more of a layup or a little bit more of a lesser deadline? What's understanding? We get the work we get and that's kind of what we have to do. But if there [00:38:00] is the project that's coming up that's a little bit less intense, I would love to be a part of it just to help me kind of breathe through and get my skills.\n\nAnd what happened was I got put onto a project from a previous manager that was not the manager I had right before I, when I leave the absence, and they told me, you know, it should be a less intense project. Everyone knows your situation, that's informed and they're okay with it. So I said, okay. And when I went on that project, it was pretty intense.\n\nI think it was just a lack of communication or understanding where I was working long hours on it, and it was pretty stressful. And there was a lot of client demands that day. We need something to turn around, you know, we would get a message in the morning, Hey, we'd like something. Could you get to us by 4:00 PM Eastern?\n\nOr we would have something and then we'd get a ping at 6:00 PM saying, Hey. Could we get ahold of this like later today or early in the morning for a 7:00 AM meeting and so suddenly it was dad balancing with the current treatments. I'm still having that. It was just a lot to juggle with and I kind of let you know manager know that this [00:39:00] wasn't what I had in mind as well as my RL and my talent consultant.\n\nAnd so what they did was they informed me of something called a tour of duty. And if you're like me, I had no clue what that meant. I honestly told my talent consultant. I was like, I'm not in the military. I'm not a veteran. I don't think that's what you have in mind. And they told me, no, no. So a tour of duty is when.\n\nIt's not always for people with medical issues, but it's kind of like a change of pace where they bring you either into internal role or a different role that maybe different expectations or maybe that you wanna transfer to a different sector but you're not too sure for amount of months that's described pre hand.\n\nYou go into a different role and there's different expectations, different RL director kind of thing, and you kind of worked through it. So for mine was it was working in internal firm services with health services and formal life. And that was everything I could have wished for and more it felt like, well, there's still a lot of work and I'm building my skills, and I feel like every week I get a little bit more on my plate.\n\nSo I feel like I'm [00:40:00] much better than I was a month ago compared to two months ago, compared to three months ago. However, I feel like with that rule, I can take a day off here and there, which I do for my treatments and not. There's going to be so much critical mass the second I get outta the doctor's office where I'm stressing, where I'm thinking, okay, maybe should I push my appointment two weeks from now?\n\nBecause right now we're in a busy period. So that new role in the tour of Duty helped me greatly.\n\n**Mark W**: It's great to hear that the firm was able to find a spot that fit you where you were at. And I think that's a recurring theme I've heard from other people that have been through life events is this is a big firm and I came back from my life event.\n\nI wasn't able to do what I was doing before. There's so many other things I can do at PwC and I wanna stay at the firm and the firm's able to work with me to put me where I can do my best right now. So, you know, Emily, I wanna move to you for a second and talk about your return to work. Yours is interesting to me because you were trying so hard to push through and you were in the Nobel Promotion year, [00:41:00] and I'm curious what it was.\n\nWhen you came back from that level of absence, how did you manage it? Did you try to jump back on the treadmill at the same speed or did you ramp yourself up? How did that work for you?\n\n**Emily Molina** (Guest): Yeah, that's a great question Mark, because I did try to jump right back onto the treadmill. I think I was still laser focused on getting promoted.\n\nMy leave lasted from February to May, so I. Missed the career round table cycle, and I knew that I had not gotten promoted. So that kind of ignited a second wave of motivation to get it at mid-years, and I was juggling that with just trying to accept that this was my life, that I did have a chronic illness.\n\nI will admit, I was doubting the diagnosis for a while. I was in denial for a while. Some important context. I was misdiagnosed with a few other things in the [00:42:00] years leading up to the diagnosis in 2019 of Chet's Disease. So I had just this underlying skepticism that no doctor really knew what was wrong with me.\n\nSo I was convinced that I could outsmart myself and really heal myself or just, you know, move on without having to deal with this disease. My team thankfully recognized those signs and they knew me well, and they knew that I might try to overcommit myself again. They actually suggested I come back in a more phased, flexible approach.\n\nSo over the course of two or three months, you know, I started at 20%. I worked my way up to 40, 60, 80, and then a hundred percent. And I'm grateful that I had that because I was dealing with a lot mentally and physically still. I wasn't a hundred percent in remission. I still had. A lot of the symptoms that led me to take the leave, but I was learning how to manage them and [00:43:00] navigate them.\n\nSimilar to Sied, I just didn't want to be a burden, so I had to deal with the fear of explaining myself or you know, there was this fear that I might need to take another leave soon because I wasn't seeing progress at the pace that I had hoped to. And I had a really difficult time recognizing what a symptom of my disease might be versus what a symptom of just working too hard.\n\nOr burnout might be like, do I have brain fog because the blood vessels in my brain are getting inflamed? Or do I have brain fog because I've been staring at this screen too long? So it was like a process of self-education, self-advocacy. I just learned to be honest with the people around me, instead of going to that private office to wait my symptoms out, I would just stay around my peers and mention to them what I was experiencing and be open one symptom at a time or one flare at a time.\n\nAnd eventually my team became as [00:44:00] good at recognizing my warning signs as I was. And I'm still really grateful for them today cuz they'll point out, Hey, you seem, you know, a little tired today, is everything okay? And. I welcome that. At this point before, I probably would have felt really uncomfortable if people thought I was off or I might be having a slow day.\n\nBut today, when somebody points that out, I'm really grateful because usually they're right and usually that means I just need to take a break.\n\n**Mark W**: It's great that you've got the relationship with your team, that they know you that well. And I guess that's part of the nature of public accounting, right, is we spend so much time with our coworkers that they know us sometimes as well as our family and friends do.\n\nSo it's great to hear they know you like that and you guys have an open enough relationship that you guys can just communicate. So, As we start to wind this episode down, I want to give each of you guys a chance to share something with the audience. So maybe Jen, I'll kick it back to you real quick, but if you could leave our audience with one piece of advice or thing to think about related to leaves of absence, what would you say?\n\n**Jennifer Barish** (Guest): Gosh, there's [00:45:00] so many things, but it goes back to my comment on communication and just keeping the lines of communication open. Whether you're going to be out short-term or long-term, and that kind of goes with your healthcare providers, your family, your friends. If you're having a bad day and you don't want visitors, you should not feel like you need to entertain in the hospital room.\n\nSo keeping the lines of communication from me. Was probably one of the most critical things, and that also kind of goes to being an open book, kind of came along with that as well, where I did share more versus less internally with my um, P W C family. And then secondly, it's so cliche, but take one day at a time.\n\nYou'll get sick of hearing about that, but it is really true because each day is gonna present differently, whether you're still on leave or your return to work. And even me like here, 13 years later, it's still one day at a time. One day, you know, as on extended use [00:46:00] steroids, I have these stiff joints and muscles.\n\nToday's Reing, I need to get up and. And guess what? I can do that. I can get up and move. No one's telling me to not get up and move. So you need to just take one day at a time and see what internally you need on that particular day. Those would be my two things. Open communication and check in with yourself daily.\n\n**Mark W**: Good advice. Syed, what about you?\n\n**Syed Jaffery**: Yes. I guess two takeaways. My first one would be for anyone who might be thinking about a leave of absence or in the leave of absence or kind of going through something, it doesn't necessarily need to be cancer like, uh, my email and messages are always open. There's been a couple people who are like, if they need to, like, do I need a leave of absence?\n\nHow do I feel being left behind? I'm always willing to listen because. I feel like the best thing to do is being able just to let someone know who won't judge them or necessarily have or in charge of them in a role or superior way of just being able to understand, have some empathy. So if you're listening to this podcast and you're someone who's kind of affected by one of these things, you can find me by email or on [00:47:00] teams.\n\nI'm always listening. The second thing that I wanna take away, I think is just being a little bit more easy in forgiving yourself. I think I had a lot of stress when I came back from my leaves absence because I just wanted to feel like I was useful, that I was gonna fall behind. And I know it's not true, but to you maybe not get let go of something happened.\n\nJust like, all right, now that I've been gone for six months, I need to prove my next six months to cover for a whole. Just be easy on yourself. You know, things are gonna be rough when you come back. That's, I think everyone knows, HR knows, everyone knows you just went through a life event. You need some time and space and all healing isn't unaligned.\n\nSome days you're gonna feel good and maybe the next week it's kind of awful. And then the next month's great. Just forgive yourself on that.\n\n**Mark W**: I think that's really good advice Syed. I've had to tell myself that one many times, and I think a lot of folks have, we're a high performing culture and we have high expectations for ourselves, and it's tough to dial that back when you don't think about the fact that you just faught cancer for six months and you [00:48:00] might not be on your A game right away, but you'll get there eventually.\n\nYou'll just have to take it day by day. Back to Jen's advice. It's just tough to get comfortable with that. All right, Emily, what about you.\n\n**Emily Molina** (Guest): I think open communication and being kind to yourself like Jen and Syed just mentioned are my main s I will say, but I'll sprinkle something new in here on the topic of having to slow down or to just stop working, I, like you said, Mark, a lot of us at PwC are those type A worker B's, and it's really hard for us to just stop working.\n\nAll of a sudden it was for me at least, and so I find. Using the same skills that I use at work to help myself throughout my leave, really kind of gave me purpose and gave me drive to get through it. Like Jen said, she built spreadsheets to help her family coordinate dinner while she couldn't cook. I also prepared a full binder, a three ring binder of my entire medical story and my family history.[00:49:00]\n\nEverything I've learned throughout this process, the treatments that worked for me, the ones that didn't work for me, instead of going through my emails and trying to keep up with work, I invested that mental energy and researching treatments for me. I had a rare disease, so I had to do a lot of research on what was out there, what the most recent clinical trials were, what other people were doing for self care.\n\nSo I would say if it's difficult for you to slow down or to take a break from, You can still use that energy and those skills that you use at work to help yourself. You just need to redirect them in the places that make the most sense. So that would be my main takeaway from this whole situation.\n\n**Mark W**: I like that advice, that kind of knowing yourself and redirecting that energy somewhere else that can benefit you.\n\nSo well, I wanna take a second to thank each of you for being on this podcast and sharing your story in such detail. And I've talked to all three of you many times about your life events and I think I learned [00:50:00] something new about each of your stories today. So thank you for taking the time to do that, sharing your experience, sharing your advice for the listen.\n\nIf you enjoyed this episode, please hit the subscribe button to be notified of future releases. Also, feel free to share this podcast with your PwC colleagues. Please follow us on Yammer where you can comment on this episode to share your thoughts. And lastly, if you haven't already, please join the Ability and Allies Inclusion Network within my story, your story.\n\nIn the meantime, if you have any feedback or would like to share your own story, PwC listeners can always reach out to the Abilities and Allies group on Yammer, or to me directly. Thank you to everyone for listening, and I look forward to hosting our next episode. Take care everyone.\n\n",
    "audioLink": "",
    "wordCount": 10236,
    "extractedAt": "2025-10-28T05:15:29.758640",
    "keyTopics": [
      "Leadership",
      "Technology",
      "Healthcare",
      "Business Strategy",
      "Career Development",
      "Culture"
    ],
    "notableQuotes": [
      {
        "quote": "I might be able to come back. This is something I, I'm thinking about.",
        "speaker": "Syed Jaffrey"
      }
    ],
    "summary": "In this episode of Present Navigating and Enduring Life Events, host(s) Mark Wilmont interview Syed Jaffrey, Emily Molina, Jennifer Barish key topics including Leadership, Technology, Healthcare. The conversation covers insights from experience at PwC."
  }
]